{"backend": "tensorflow", "class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 128, 128], "dtype": "float32", "sparse": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "name": "conv2d_1", "trainable": true, "use_bias": true, "kernel_size": [3, 3], "data_format": "channels_first", "activation": "linear", "activity_regularizer": null, "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1, 1]}, "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "name": "activation_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "name": "conv2d_2", "trainable": true, "use_bias": true, "kernel_size": [3, 3], "data_format": "channels_first", "activation": "linear", "activity_regularizer": null, "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1, 1]}, "name": "conv2d_2", "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "name": "activation_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_first", "strides": [2, 2]}, "name": "max_pooling2d_1", "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "name": "conv2d_3", "trainable": true, "use_bias": true, "kernel_size": [3, 3], "data_format": "channels_first", "activation": "linear", "activity_regularizer": null, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1, 1]}, "name": "conv2d_3", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "name": "activation_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "name": "conv2d_4", "trainable": true, "use_bias": true, "kernel_size": [3, 3], "data_format": "channels_first", "activation": "linear", "activity_regularizer": null, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1, 1]}, "name": "conv2d_4", "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "name": "activation_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_first", "strides": [2, 2]}, "name": "max_pooling2d_2", "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "name": "conv2d_5", "trainable": true, "use_bias": true, "kernel_size": [3, 3], "data_format": "channels_first", "activation": "linear", "activity_regularizer": null, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1, 1]}, "name": "conv2d_5", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}, "name": "activation_5", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "name": "conv2d_6", "trainable": true, "use_bias": true, "kernel_size": [3, 3], "data_format": "channels_first", "activation": "linear", "activity_regularizer": null, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1, 1]}, "name": "conv2d_6", "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}, "name": "activation_6", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_3", "data_format": "channels_first", "strides": [2, 2]}, "name": "max_pooling2d_3", "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "name": "conv2d_7", "trainable": true, "use_bias": true, "kernel_size": [3, 3], "data_format": "channels_first", "activation": "linear", "activity_regularizer": null, "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1, 1]}, "name": "conv2d_7", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_7", "activation": "relu"}, "name": "activation_7", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "name": "conv2d_8", "trainable": true, "use_bias": true, "kernel_size": [3, 3], "data_format": "channels_first", "activation": "linear", "activity_regularizer": null, "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1, 1]}, "name": "conv2d_8", "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_8", "activation": "relu"}, "name": "activation_8", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_4", "data_format": "channels_first", "strides": [2, 2]}, "name": "max_pooling2d_4", "inbound_nodes": [[["activation_8", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "name": "conv2d_9", "trainable": true, "use_bias": true, "kernel_size": [3, 3], "data_format": "channels_first", "activation": "linear", "activity_regularizer": null, "filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1, 1]}, "name": "conv2d_9", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_9", "activation": "relu"}, "name": "activation_9", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "name": "conv2d_10", "trainable": true, "use_bias": true, "kernel_size": [3, 3], "data_format": "channels_first", "activation": "linear", "activity_regularizer": null, "filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1, 1]}, "name": "conv2d_10", "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_10", "activation": "relu"}, "name": "activation_10", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "up_sampling2d_1", "data_format": "channels_first", "size": [2, 2]}, "name": "up_sampling2d_1", "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"trainable": true, "axis": 1, "name": "concatenate_1"}, "name": "concatenate_1", "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}], ["activation_8", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "name": "conv2d_11", "trainable": true, "use_bias": true, "kernel_size": [3, 3], "data_format": "channels_first", "activation": "linear", "activity_regularizer": null, "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1, 1]}, "name": "conv2d_11", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_11", "activation": "relu"}, "name": "activation_11", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "name": "conv2d_12", "trainable": true, "use_bias": true, "kernel_size": [3, 3], "data_format": "channels_first", "activation": "linear", "activity_regularizer": null, "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1, 1]}, "name": "conv2d_12", "inbound_nodes": [[["activation_11", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_12", "activation": "relu"}, "name": "activation_12", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "up_sampling2d_2", "data_format": "channels_first", "size": [2, 2]}, "name": "up_sampling2d_2", "inbound_nodes": [[["activation_12", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"trainable": true, "axis": 1, "name": "concatenate_2"}, "name": "concatenate_2", "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}], ["activation_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "name": "conv2d_13", "trainable": true, "use_bias": true, "kernel_size": [3, 3], "data_format": "channels_first", "activation": "linear", "activity_regularizer": null, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1, 1]}, "name": "conv2d_13", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_13", "activation": "relu"}, "name": "activation_13", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "name": "conv2d_14", "trainable": true, "use_bias": true, "kernel_size": [3, 3], "data_format": "channels_first", "activation": "linear", "activity_regularizer": null, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1, 1]}, "name": "conv2d_14", "inbound_nodes": [[["activation_13", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_14", "activation": "relu"}, "name": "activation_14", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "up_sampling2d_3", "data_format": "channels_first", "size": [2, 2]}, "name": "up_sampling2d_3", "inbound_nodes": [[["activation_14", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"trainable": true, "axis": 1, "name": "concatenate_3"}, "name": "concatenate_3", "inbound_nodes": [[["up_sampling2d_3", 0, 0, {}], ["activation_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "name": "conv2d_15", "trainable": true, "use_bias": true, "kernel_size": [3, 3], "data_format": "channels_first", "activation": "linear", "activity_regularizer": null, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1, 1]}, "name": "conv2d_15", "inbound_nodes": [[["concatenate_3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_15", "activation": "relu"}, "name": "activation_15", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "name": "conv2d_16", "trainable": true, "use_bias": true, "kernel_size": [3, 3], "data_format": "channels_first", "activation": "linear", "activity_regularizer": null, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1, 1]}, "name": "conv2d_16", "inbound_nodes": [[["activation_15", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_16", "activation": "relu"}, "name": "activation_16", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "up_sampling2d_4", "data_format": "channels_first", "size": [2, 2]}, "name": "up_sampling2d_4", "inbound_nodes": [[["activation_16", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"trainable": true, "axis": 1, "name": "concatenate_4"}, "name": "concatenate_4", "inbound_nodes": [[["up_sampling2d_4", 0, 0, {}], ["activation_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "name": "conv2d_17", "trainable": true, "use_bias": true, "kernel_size": [3, 3], "data_format": "channels_first", "activation": "linear", "activity_regularizer": null, "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1, 1]}, "name": "conv2d_17", "inbound_nodes": [[["concatenate_4", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_17", "activation": "relu"}, "name": "activation_17", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "name": "conv2d_18", "trainable": true, "use_bias": true, "kernel_size": [3, 3], "data_format": "channels_first", "activation": "linear", "activity_regularizer": null, "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1, 1]}, "name": "conv2d_18", "inbound_nodes": [[["activation_17", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_18", "activation": "relu"}, "name": "activation_18", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "name": "conv2d_19", "trainable": true, "use_bias": true, "kernel_size": [1, 1], "data_format": "channels_first", "activation": "linear", "activity_regularizer": null, "filters": 2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [1, 1]}, "name": "conv2d_19", "inbound_nodes": [[["activation_18", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_19", "activation": "sigmoid"}, "name": "activation_19", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["activation_19", 0, 0]], "name": "model_1"}, "keras_version": "2.0.9"}