{"backend": "tensorflow", "config": {"input_layers": [["input_1", 0, 0]], "name": "generator", "layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_1", "batch_input_shape": [null, 2, 128, 128], "sparse": false, "dtype": "float32"}}, {"name": "conv2d_1", "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_size": [3, 3], "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "name": "conv2d_1", "filters": 16, "padding": "same", "data_format": "channels_first", "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null}}, {"name": "activation_1", "class_name": "Activation", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"name": "conv2d_2", "class_name": "Conv2D", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_size": [3, 3], "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "name": "conv2d_2", "filters": 16, "padding": "same", "data_format": "channels_first", "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null}}, {"name": "activation_2", "class_name": "Activation", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"name": "max_pooling2d_1", "class_name": "MaxPooling2D", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"strides": [2, 2], "name": "max_pooling2d_1", "pool_size": [2, 2], "padding": "valid", "data_format": "channels_first", "trainable": true}}, {"name": "conv2d_3", "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_size": [3, 3], "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "name": "conv2d_3", "filters": 32, "padding": "same", "data_format": "channels_first", "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null}}, {"name": "activation_3", "class_name": "Activation", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"name": "conv2d_4", "class_name": "Conv2D", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_size": [3, 3], "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "name": "conv2d_4", "filters": 32, "padding": "same", "data_format": "channels_first", "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null}}, {"name": "activation_4", "class_name": "Activation", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"name": "max_pooling2d_2", "class_name": "MaxPooling2D", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"strides": [2, 2], "name": "max_pooling2d_2", "pool_size": [2, 2], "padding": "valid", "data_format": "channels_first", "trainable": true}}, {"name": "conv2d_5", "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_size": [3, 3], "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "name": "conv2d_5", "filters": 64, "padding": "same", "data_format": "channels_first", "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null}}, {"name": "activation_5", "class_name": "Activation", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"name": "activation_5", "trainable": true, "activation": "relu"}}, {"name": "conv2d_6", "class_name": "Conv2D", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_size": [3, 3], "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "name": "conv2d_6", "filters": 64, "padding": "same", "data_format": "channels_first", "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null}}, {"name": "activation_6", "class_name": "Activation", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"name": "activation_6", "trainable": true, "activation": "relu"}}, {"name": "max_pooling2d_3", "class_name": "MaxPooling2D", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "config": {"strides": [2, 2], "name": "max_pooling2d_3", "pool_size": [2, 2], "padding": "valid", "data_format": "channels_first", "trainable": true}}, {"name": "conv2d_7", "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_size": [3, 3], "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "name": "conv2d_7", "filters": 128, "padding": "same", "data_format": "channels_first", "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null}}, {"name": "activation_7", "class_name": "Activation", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"name": "activation_7", "trainable": true, "activation": "relu"}}, {"name": "conv2d_8", "class_name": "Conv2D", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_size": [3, 3], "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "name": "conv2d_8", "filters": 128, "padding": "same", "data_format": "channels_first", "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null}}, {"name": "activation_8", "class_name": "Activation", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "config": {"name": "activation_8", "trainable": true, "activation": "relu"}}, {"name": "up_sampling2d_1", "class_name": "UpSampling2D", "inbound_nodes": [[["activation_8", 0, 0, {}]]], "config": {"name": "up_sampling2d_1", "size": [2, 2], "trainable": true, "data_format": "channels_first"}}, {"name": "concatenate_1", "class_name": "Concatenate", "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}], ["activation_6", 0, 0, {}]]], "config": {"name": "concatenate_1", "trainable": true, "axis": 1}}, {"name": "conv2d_9", "class_name": "Conv2D", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_size": [3, 3], "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "name": "conv2d_9", "filters": 64, "padding": "same", "data_format": "channels_first", "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null}}, {"name": "activation_9", "class_name": "Activation", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "config": {"name": "activation_9", "trainable": true, "activation": "relu"}}, {"name": "conv2d_10", "class_name": "Conv2D", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_size": [3, 3], "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "name": "conv2d_10", "filters": 64, "padding": "same", "data_format": "channels_first", "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null}}, {"name": "activation_10", "class_name": "Activation", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "config": {"name": "activation_10", "trainable": true, "activation": "relu"}}, {"name": "up_sampling2d_2", "class_name": "UpSampling2D", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "config": {"name": "up_sampling2d_2", "size": [2, 2], "trainable": true, "data_format": "channels_first"}}, {"name": "concatenate_2", "class_name": "Concatenate", "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}], ["activation_4", 0, 0, {}]]], "config": {"name": "concatenate_2", "trainable": true, "axis": 1}}, {"name": "conv2d_11", "class_name": "Conv2D", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_size": [3, 3], "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "name": "conv2d_11", "filters": 32, "padding": "same", "data_format": "channels_first", "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null}}, {"name": "activation_11", "class_name": "Activation", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "config": {"name": "activation_11", "trainable": true, "activation": "relu"}}, {"name": "conv2d_12", "class_name": "Conv2D", "inbound_nodes": [[["activation_11", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_size": [3, 3], "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "name": "conv2d_12", "filters": 32, "padding": "same", "data_format": "channels_first", "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null}}, {"name": "activation_12", "class_name": "Activation", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "config": {"name": "activation_12", "trainable": true, "activation": "relu"}}, {"name": "up_sampling2d_3", "class_name": "UpSampling2D", "inbound_nodes": [[["activation_12", 0, 0, {}]]], "config": {"name": "up_sampling2d_3", "size": [2, 2], "trainable": true, "data_format": "channels_first"}}, {"name": "concatenate_3", "class_name": "Concatenate", "inbound_nodes": [[["up_sampling2d_3", 0, 0, {}], ["activation_2", 0, 0, {}]]], "config": {"name": "concatenate_3", "trainable": true, "axis": 1}}, {"name": "conv2d_13", "class_name": "Conv2D", "inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_size": [3, 3], "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "name": "conv2d_13", "filters": 16, "padding": "same", "data_format": "channels_first", "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null}}, {"name": "activation_13", "class_name": "Activation", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "config": {"name": "activation_13", "trainable": true, "activation": "relu"}}, {"name": "conv2d_14", "class_name": "Conv2D", "inbound_nodes": [[["activation_13", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_size": [3, 3], "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "name": "conv2d_14", "filters": 16, "padding": "same", "data_format": "channels_first", "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null}}, {"name": "activation_14", "class_name": "Activation", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "config": {"name": "activation_14", "trainable": true, "activation": "relu"}}, {"name": "conv2d_15", "class_name": "Conv2D", "inbound_nodes": [[["activation_14", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_size": [1, 1], "activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "name": "conv2d_15", "filters": 1, "padding": "valid", "data_format": "channels_first", "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null}}, {"name": "activation_15", "class_name": "Activation", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "config": {"name": "activation_15", "trainable": true, "activation": "sigmoid"}}], "output_layers": [["activation_15", 0, 0]]}, "class_name": "Model", "keras_version": "2.0.9"}