{"class_name": "Model", "config": {"name": "model_25", "layers": [{"name": "input_13", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 1], "dtype": "float32", "sparse": false, "name": "input_13"}, "inbound_nodes": []}, {"name": "conv2d_229", "class_name": "Conv2D", "config": {"name": "conv2d_229", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_13", 0, 0, {}]]]}, {"name": "activation_229", "class_name": "Activation", "config": {"name": "activation_229", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_229", 0, 0, {}]]]}, {"name": "conv2d_230", "class_name": "Conv2D", "config": {"name": "conv2d_230", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_229", 0, 0, {}]]]}, {"name": "activation_230", "class_name": "Activation", "config": {"name": "activation_230", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_230", 0, 0, {}]]]}, {"name": "max_pooling2d_49", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_49", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_230", 0, 0, {}]]]}, {"name": "conv2d_231", "class_name": "Conv2D", "config": {"name": "conv2d_231", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_49", 0, 0, {}]]]}, {"name": "activation_231", "class_name": "Activation", "config": {"name": "activation_231", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_231", 0, 0, {}]]]}, {"name": "conv2d_232", "class_name": "Conv2D", "config": {"name": "conv2d_232", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_231", 0, 0, {}]]]}, {"name": "activation_232", "class_name": "Activation", "config": {"name": "activation_232", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_232", 0, 0, {}]]]}, {"name": "max_pooling2d_50", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_50", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_232", 0, 0, {}]]]}, {"name": "conv2d_233", "class_name": "Conv2D", "config": {"name": "conv2d_233", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_50", 0, 0, {}]]]}, {"name": "activation_233", "class_name": "Activation", "config": {"name": "activation_233", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_233", 0, 0, {}]]]}, {"name": "conv2d_234", "class_name": "Conv2D", "config": {"name": "conv2d_234", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_233", 0, 0, {}]]]}, {"name": "activation_234", "class_name": "Activation", "config": {"name": "activation_234", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_234", 0, 0, {}]]]}, {"name": "max_pooling2d_51", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_51", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_234", 0, 0, {}]]]}, {"name": "conv2d_235", "class_name": "Conv2D", "config": {"name": "conv2d_235", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_51", 0, 0, {}]]]}, {"name": "activation_235", "class_name": "Activation", "config": {"name": "activation_235", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_235", 0, 0, {}]]]}, {"name": "conv2d_236", "class_name": "Conv2D", "config": {"name": "conv2d_236", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_235", 0, 0, {}]]]}, {"name": "activation_236", "class_name": "Activation", "config": {"name": "activation_236", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_236", 0, 0, {}]]]}, {"name": "max_pooling2d_52", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_52", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_236", 0, 0, {}]]]}, {"name": "conv2d_237", "class_name": "Conv2D", "config": {"name": "conv2d_237", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_52", 0, 0, {}]]]}, {"name": "activation_237", "class_name": "Activation", "config": {"name": "activation_237", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_237", 0, 0, {}]]]}, {"name": "conv2d_238", "class_name": "Conv2D", "config": {"name": "conv2d_238", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_237", 0, 0, {}]]]}, {"name": "activation_238", "class_name": "Activation", "config": {"name": "activation_238", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_238", 0, 0, {}]]]}, {"name": "up_sampling2d_49", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_49", "trainable": true, "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["activation_238", 0, 0, {}]]]}, {"name": "concatenate_49", "class_name": "Concatenate", "config": {"name": "concatenate_49", "trainable": true, "axis": -1}, "inbound_nodes": [[["up_sampling2d_49", 0, 0, {}], ["activation_236", 0, 0, {}]]]}, {"name": "conv2d_239", "class_name": "Conv2D", "config": {"name": "conv2d_239", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_49", 0, 0, {}]]]}, {"name": "activation_239", "class_name": "Activation", "config": {"name": "activation_239", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_239", 0, 0, {}]]]}, {"name": "conv2d_240", "class_name": "Conv2D", "config": {"name": "conv2d_240", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_239", 0, 0, {}]]]}, {"name": "activation_240", "class_name": "Activation", "config": {"name": "activation_240", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_240", 0, 0, {}]]]}, {"name": "up_sampling2d_50", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_50", "trainable": true, "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["activation_240", 0, 0, {}]]]}, {"name": "concatenate_50", "class_name": "Concatenate", "config": {"name": "concatenate_50", "trainable": true, "axis": -1}, "inbound_nodes": [[["up_sampling2d_50", 0, 0, {}], ["activation_234", 0, 0, {}]]]}, {"name": "conv2d_241", "class_name": "Conv2D", "config": {"name": "conv2d_241", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_50", 0, 0, {}]]]}, {"name": "activation_241", "class_name": "Activation", "config": {"name": "activation_241", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_241", 0, 0, {}]]]}, {"name": "conv2d_242", "class_name": "Conv2D", "config": {"name": "conv2d_242", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_241", 0, 0, {}]]]}, {"name": "activation_242", "class_name": "Activation", "config": {"name": "activation_242", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_242", 0, 0, {}]]]}, {"name": "up_sampling2d_51", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_51", "trainable": true, "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["activation_242", 0, 0, {}]]]}, {"name": "concatenate_51", "class_name": "Concatenate", "config": {"name": "concatenate_51", "trainable": true, "axis": -1}, "inbound_nodes": [[["up_sampling2d_51", 0, 0, {}], ["activation_232", 0, 0, {}]]]}, {"name": "conv2d_243", "class_name": "Conv2D", "config": {"name": "conv2d_243", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_51", 0, 0, {}]]]}, {"name": "activation_243", "class_name": "Activation", "config": {"name": "activation_243", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_243", 0, 0, {}]]]}, {"name": "conv2d_244", "class_name": "Conv2D", "config": {"name": "conv2d_244", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_243", 0, 0, {}]]]}, {"name": "activation_244", "class_name": "Activation", "config": {"name": "activation_244", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_244", 0, 0, {}]]]}, {"name": "up_sampling2d_52", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_52", "trainable": true, "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["activation_244", 0, 0, {}]]]}, {"name": "concatenate_52", "class_name": "Concatenate", "config": {"name": "concatenate_52", "trainable": true, "axis": -1}, "inbound_nodes": [[["up_sampling2d_52", 0, 0, {}], ["activation_230", 0, 0, {}]]]}, {"name": "conv2d_245", "class_name": "Conv2D", "config": {"name": "conv2d_245", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_52", 0, 0, {}]]]}, {"name": "activation_245", "class_name": "Activation", "config": {"name": "activation_245", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_245", 0, 0, {}]]]}, {"name": "conv2d_246", "class_name": "Conv2D", "config": {"name": "conv2d_246", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_245", 0, 0, {}]]]}, {"name": "activation_246", "class_name": "Activation", "config": {"name": "activation_246", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_246", 0, 0, {}]]]}, {"name": "conv2d_247", "class_name": "Conv2D", "config": {"name": "conv2d_247", "trainable": true, "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_246", 0, 0, {}]]]}, {"name": "activation_247", "class_name": "Activation", "config": {"name": "activation_247", "trainable": true, "activation": "sigmoid"}, "inbound_nodes": [[["conv2d_247", 0, 0, {}]]]}], "input_layers": [["input_13", 0, 0]], "output_layers": [["activation_247", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}