{"class_name": "Model", "config": {"name": "model_11", "layers": [{"name": "input_6", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false, "name": "input_6"}, "inbound_nodes": []}, {"name": "conv2d_96", "class_name": "Conv2D", "config": {"name": "conv2d_96", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_6", 0, 0, {}]]]}, {"name": "activation_96", "class_name": "Activation", "config": {"name": "activation_96", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_96", 0, 0, {}]]]}, {"name": "conv2d_97", "class_name": "Conv2D", "config": {"name": "conv2d_97", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_96", 0, 0, {}]]]}, {"name": "activation_97", "class_name": "Activation", "config": {"name": "activation_97", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_97", 0, 0, {}]]]}, {"name": "max_pooling2d_21", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_21", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_97", 0, 0, {}]]]}, {"name": "conv2d_98", "class_name": "Conv2D", "config": {"name": "conv2d_98", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_21", 0, 0, {}]]]}, {"name": "activation_98", "class_name": "Activation", "config": {"name": "activation_98", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_98", 0, 0, {}]]]}, {"name": "conv2d_99", "class_name": "Conv2D", "config": {"name": "conv2d_99", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_98", 0, 0, {}]]]}, {"name": "activation_99", "class_name": "Activation", "config": {"name": "activation_99", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_99", 0, 0, {}]]]}, {"name": "max_pooling2d_22", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_22", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_99", 0, 0, {}]]]}, {"name": "conv2d_100", "class_name": "Conv2D", "config": {"name": "conv2d_100", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_22", 0, 0, {}]]]}, {"name": "activation_100", "class_name": "Activation", "config": {"name": "activation_100", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_100", 0, 0, {}]]]}, {"name": "conv2d_101", "class_name": "Conv2D", "config": {"name": "conv2d_101", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_100", 0, 0, {}]]]}, {"name": "activation_101", "class_name": "Activation", "config": {"name": "activation_101", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_101", 0, 0, {}]]]}, {"name": "max_pooling2d_23", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_23", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_101", 0, 0, {}]]]}, {"name": "conv2d_102", "class_name": "Conv2D", "config": {"name": "conv2d_102", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_23", 0, 0, {}]]]}, {"name": "activation_102", "class_name": "Activation", "config": {"name": "activation_102", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_102", 0, 0, {}]]]}, {"name": "conv2d_103", "class_name": "Conv2D", "config": {"name": "conv2d_103", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_102", 0, 0, {}]]]}, {"name": "activation_103", "class_name": "Activation", "config": {"name": "activation_103", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_103", 0, 0, {}]]]}, {"name": "max_pooling2d_24", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_24", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_103", 0, 0, {}]]]}, {"name": "conv2d_104", "class_name": "Conv2D", "config": {"name": "conv2d_104", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_24", 0, 0, {}]]]}, {"name": "activation_104", "class_name": "Activation", "config": {"name": "activation_104", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_104", 0, 0, {}]]]}, {"name": "conv2d_105", "class_name": "Conv2D", "config": {"name": "conv2d_105", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_104", 0, 0, {}]]]}, {"name": "activation_105", "class_name": "Activation", "config": {"name": "activation_105", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_105", 0, 0, {}]]]}, {"name": "up_sampling2d_21", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_21", "trainable": true, "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["activation_105", 0, 0, {}]]]}, {"name": "concatenate_21", "class_name": "Concatenate", "config": {"name": "concatenate_21", "trainable": true, "axis": -1}, "inbound_nodes": [[["up_sampling2d_21", 0, 0, {}], ["activation_103", 0, 0, {}]]]}, {"name": "conv2d_106", "class_name": "Conv2D", "config": {"name": "conv2d_106", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_21", 0, 0, {}]]]}, {"name": "activation_106", "class_name": "Activation", "config": {"name": "activation_106", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_106", 0, 0, {}]]]}, {"name": "conv2d_107", "class_name": "Conv2D", "config": {"name": "conv2d_107", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_106", 0, 0, {}]]]}, {"name": "activation_107", "class_name": "Activation", "config": {"name": "activation_107", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_107", 0, 0, {}]]]}, {"name": "up_sampling2d_22", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_22", "trainable": true, "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["activation_107", 0, 0, {}]]]}, {"name": "concatenate_22", "class_name": "Concatenate", "config": {"name": "concatenate_22", "trainable": true, "axis": -1}, "inbound_nodes": [[["up_sampling2d_22", 0, 0, {}], ["activation_101", 0, 0, {}]]]}, {"name": "conv2d_108", "class_name": "Conv2D", "config": {"name": "conv2d_108", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_22", 0, 0, {}]]]}, {"name": "activation_108", "class_name": "Activation", "config": {"name": "activation_108", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_108", 0, 0, {}]]]}, {"name": "conv2d_109", "class_name": "Conv2D", "config": {"name": "conv2d_109", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_108", 0, 0, {}]]]}, {"name": "activation_109", "class_name": "Activation", "config": {"name": "activation_109", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_109", 0, 0, {}]]]}, {"name": "up_sampling2d_23", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_23", "trainable": true, "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["activation_109", 0, 0, {}]]]}, {"name": "concatenate_23", "class_name": "Concatenate", "config": {"name": "concatenate_23", "trainable": true, "axis": -1}, "inbound_nodes": [[["up_sampling2d_23", 0, 0, {}], ["activation_99", 0, 0, {}]]]}, {"name": "conv2d_110", "class_name": "Conv2D", "config": {"name": "conv2d_110", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_23", 0, 0, {}]]]}, {"name": "activation_110", "class_name": "Activation", "config": {"name": "activation_110", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_110", 0, 0, {}]]]}, {"name": "conv2d_111", "class_name": "Conv2D", "config": {"name": "conv2d_111", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_110", 0, 0, {}]]]}, {"name": "activation_111", "class_name": "Activation", "config": {"name": "activation_111", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_111", 0, 0, {}]]]}, {"name": "up_sampling2d_24", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_24", "trainable": true, "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["activation_111", 0, 0, {}]]]}, {"name": "concatenate_24", "class_name": "Concatenate", "config": {"name": "concatenate_24", "trainable": true, "axis": -1}, "inbound_nodes": [[["up_sampling2d_24", 0, 0, {}], ["activation_97", 0, 0, {}]]]}, {"name": "conv2d_112", "class_name": "Conv2D", "config": {"name": "conv2d_112", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_24", 0, 0, {}]]]}, {"name": "activation_112", "class_name": "Activation", "config": {"name": "activation_112", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_112", 0, 0, {}]]]}, {"name": "conv2d_113", "class_name": "Conv2D", "config": {"name": "conv2d_113", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_112", 0, 0, {}]]]}, {"name": "activation_113", "class_name": "Activation", "config": {"name": "activation_113", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_113", 0, 0, {}]]]}, {"name": "conv2d_114", "class_name": "Conv2D", "config": {"name": "conv2d_114", "trainable": true, "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_113", 0, 0, {}]]]}, {"name": "activation_114", "class_name": "Activation", "config": {"name": "activation_114", "trainable": true, "activation": "sigmoid"}, "inbound_nodes": [[["conv2d_114", 0, 0, {}]]]}], "input_layers": [["input_6", 0, 0]], "output_layers": [["activation_114", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}