{"class_name": "Model", "config": {"name": "model_11", "layers": [{"name": "input_6", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 128, 128, 1], "dtype": "float32", "sparse": false, "name": "input_6"}, "inbound_nodes": []}, {"name": "conv2d_116", "class_name": "Conv2D", "config": {"name": "conv2d_116", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_6", 0, 0, {}]]]}, {"name": "activation_96", "class_name": "Activation", "config": {"name": "activation_96", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_116", 0, 0, {}]]]}, {"name": "conv2d_117", "class_name": "Conv2D", "config": {"name": "conv2d_117", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_96", 0, 0, {}]]]}, {"name": "activation_97", "class_name": "Activation", "config": {"name": "activation_97", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_117", 0, 0, {}]]]}, {"name": "max_pooling2d_21", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_21", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_97", 0, 0, {}]]]}, {"name": "conv2d_118", "class_name": "Conv2D", "config": {"name": "conv2d_118", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_21", 0, 0, {}]]]}, {"name": "activation_98", "class_name": "Activation", "config": {"name": "activation_98", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_118", 0, 0, {}]]]}, {"name": "conv2d_119", "class_name": "Conv2D", "config": {"name": "conv2d_119", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_98", 0, 0, {}]]]}, {"name": "activation_99", "class_name": "Activation", "config": {"name": "activation_99", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_119", 0, 0, {}]]]}, {"name": "max_pooling2d_22", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_22", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_99", 0, 0, {}]]]}, {"name": "conv2d_120", "class_name": "Conv2D", "config": {"name": "conv2d_120", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_22", 0, 0, {}]]]}, {"name": "activation_100", "class_name": "Activation", "config": {"name": "activation_100", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_120", 0, 0, {}]]]}, {"name": "conv2d_121", "class_name": "Conv2D", "config": {"name": "conv2d_121", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_100", 0, 0, {}]]]}, {"name": "activation_101", "class_name": "Activation", "config": {"name": "activation_101", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_121", 0, 0, {}]]]}, {"name": "max_pooling2d_23", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_23", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_101", 0, 0, {}]]]}, {"name": "conv2d_122", "class_name": "Conv2D", "config": {"name": "conv2d_122", "trainable": true, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_23", 0, 0, {}]]]}, {"name": "activation_102", "class_name": "Activation", "config": {"name": "activation_102", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_122", 0, 0, {}]]]}, {"name": "conv2d_123", "class_name": "Conv2D", "config": {"name": "conv2d_123", "trainable": true, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_102", 0, 0, {}]]]}, {"name": "activation_103", "class_name": "Activation", "config": {"name": "activation_103", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_123", 0, 0, {}]]]}, {"name": "max_pooling2d_24", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_24", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_103", 0, 0, {}]]]}, {"name": "conv2d_124", "class_name": "Conv2D", "config": {"name": "conv2d_124", "trainable": true, "filters": 1024, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_24", 0, 0, {}]]]}, {"name": "activation_104", "class_name": "Activation", "config": {"name": "activation_104", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_124", 0, 0, {}]]]}, {"name": "conv2d_125", "class_name": "Conv2D", "config": {"name": "conv2d_125", "trainable": true, "filters": 1024, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_104", 0, 0, {}]]]}, {"name": "activation_105", "class_name": "Activation", "config": {"name": "activation_105", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_125", 0, 0, {}]]]}, {"name": "up_sampling2d_21", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_21", "trainable": true, "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["activation_105", 0, 0, {}]]]}, {"name": "conv2d_126", "class_name": "Conv2D", "config": {"name": "conv2d_126", "trainable": true, "filters": 1024, "kernel_size": [2, 2], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_21", 0, 0, {}]]]}, {"name": "concatenate_21", "class_name": "Concatenate", "config": {"name": "concatenate_21", "trainable": true, "axis": -1}, "inbound_nodes": [[["conv2d_126", 0, 0, {}], ["activation_103", 0, 0, {}]]]}, {"name": "conv2d_127", "class_name": "Conv2D", "config": {"name": "conv2d_127", "trainable": true, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_21", 0, 0, {}]]]}, {"name": "activation_106", "class_name": "Activation", "config": {"name": "activation_106", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_127", 0, 0, {}]]]}, {"name": "conv2d_128", "class_name": "Conv2D", "config": {"name": "conv2d_128", "trainable": true, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_106", 0, 0, {}]]]}, {"name": "activation_107", "class_name": "Activation", "config": {"name": "activation_107", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_128", 0, 0, {}]]]}, {"name": "up_sampling2d_22", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_22", "trainable": true, "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["activation_107", 0, 0, {}]]]}, {"name": "conv2d_129", "class_name": "Conv2D", "config": {"name": "conv2d_129", "trainable": true, "filters": 512, "kernel_size": [2, 2], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_22", 0, 0, {}]]]}, {"name": "concatenate_22", "class_name": "Concatenate", "config": {"name": "concatenate_22", "trainable": true, "axis": -1}, "inbound_nodes": [[["conv2d_129", 0, 0, {}], ["activation_101", 0, 0, {}]]]}, {"name": "conv2d_130", "class_name": "Conv2D", "config": {"name": "conv2d_130", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_22", 0, 0, {}]]]}, {"name": "activation_108", "class_name": "Activation", "config": {"name": "activation_108", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_130", 0, 0, {}]]]}, {"name": "conv2d_131", "class_name": "Conv2D", "config": {"name": "conv2d_131", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_108", 0, 0, {}]]]}, {"name": "activation_109", "class_name": "Activation", "config": {"name": "activation_109", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_131", 0, 0, {}]]]}, {"name": "up_sampling2d_23", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_23", "trainable": true, "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["activation_109", 0, 0, {}]]]}, {"name": "conv2d_132", "class_name": "Conv2D", "config": {"name": "conv2d_132", "trainable": true, "filters": 256, "kernel_size": [2, 2], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_23", 0, 0, {}]]]}, {"name": "concatenate_23", "class_name": "Concatenate", "config": {"name": "concatenate_23", "trainable": true, "axis": -1}, "inbound_nodes": [[["conv2d_132", 0, 0, {}], ["activation_99", 0, 0, {}]]]}, {"name": "conv2d_133", "class_name": "Conv2D", "config": {"name": "conv2d_133", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_23", 0, 0, {}]]]}, {"name": "activation_110", "class_name": "Activation", "config": {"name": "activation_110", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_133", 0, 0, {}]]]}, {"name": "conv2d_134", "class_name": "Conv2D", "config": {"name": "conv2d_134", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_110", 0, 0, {}]]]}, {"name": "activation_111", "class_name": "Activation", "config": {"name": "activation_111", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_134", 0, 0, {}]]]}, {"name": "up_sampling2d_24", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_24", "trainable": true, "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["activation_111", 0, 0, {}]]]}, {"name": "conv2d_135", "class_name": "Conv2D", "config": {"name": "conv2d_135", "trainable": true, "filters": 128, "kernel_size": [2, 2], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_24", 0, 0, {}]]]}, {"name": "concatenate_24", "class_name": "Concatenate", "config": {"name": "concatenate_24", "trainable": true, "axis": -1}, "inbound_nodes": [[["conv2d_135", 0, 0, {}], ["activation_97", 0, 0, {}]]]}, {"name": "conv2d_136", "class_name": "Conv2D", "config": {"name": "conv2d_136", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_24", 0, 0, {}]]]}, {"name": "activation_112", "class_name": "Activation", "config": {"name": "activation_112", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_136", 0, 0, {}]]]}, {"name": "conv2d_137", "class_name": "Conv2D", "config": {"name": "conv2d_137", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_112", 0, 0, {}]]]}, {"name": "activation_113", "class_name": "Activation", "config": {"name": "activation_113", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_137", 0, 0, {}]]]}, {"name": "conv2d_138", "class_name": "Conv2D", "config": {"name": "conv2d_138", "trainable": true, "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_113", 0, 0, {}]]]}, {"name": "activation_114", "class_name": "Activation", "config": {"name": "activation_114", "trainable": true, "activation": "sigmoid"}, "inbound_nodes": [[["conv2d_138", 0, 0, {}]]]}], "input_layers": [["input_6", 0, 0]], "output_layers": [["activation_114", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}