{"config": {"input_layers": [["input_1", 0, 0]], "layers": [{"config": {"dtype": "float32", "batch_input_shape": [null, 2, 128, 128], "sparse": false, "name": "input_1"}, "inbound_nodes": [], "class_name": "InputLayer", "name": "input_1"}, {"config": {"strides": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "filters": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_1", "data_format": "channels_first", "padding": "same"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_1"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "Activation", "name": "activation_1"}, {"config": {"strides": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "filters": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_2", "data_format": "channels_first", "padding": "same"}, "inbound_nodes": [[["activation_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_2"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "Activation", "name": "activation_2"}, {"config": {"strides": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_first", "trainable": true, "pool_size": [2, 2], "padding": "valid"}, "inbound_nodes": [[["activation_2", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_1"}, {"config": {"strides": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_3", "data_format": "channels_first", "padding": "same"}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_3"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "Activation", "name": "activation_3"}, {"config": {"strides": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_4", "data_format": "channels_first", "padding": "same"}, "inbound_nodes": [[["activation_3", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_4"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "Activation", "name": "activation_4"}, {"config": {"strides": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_first", "trainable": true, "pool_size": [2, 2], "padding": "valid"}, "inbound_nodes": [[["activation_4", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_2"}, {"config": {"strides": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_5", "data_format": "channels_first", "padding": "same"}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_5"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_5"}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "Activation", "name": "activation_5"}, {"config": {"strides": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_6", "data_format": "channels_first", "padding": "same"}, "inbound_nodes": [[["activation_5", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_6"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_6"}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "class_name": "Activation", "name": "activation_6"}, {"config": {"strides": [2, 2], "name": "max_pooling2d_3", "data_format": "channels_first", "trainable": true, "pool_size": [2, 2], "padding": "valid"}, "inbound_nodes": [[["activation_6", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_3"}, {"config": {"strides": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_7", "data_format": "channels_first", "padding": "same"}, "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_7"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_7"}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "class_name": "Activation", "name": "activation_7"}, {"config": {"strides": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_8", "data_format": "channels_first", "padding": "same"}, "inbound_nodes": [[["activation_7", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_8"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_8"}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "class_name": "Activation", "name": "activation_8"}, {"config": {"size": [2, 2], "trainable": true, "name": "up_sampling2d_1", "data_format": "channels_first"}, "inbound_nodes": [[["activation_8", 0, 0, {}]]], "class_name": "UpSampling2D", "name": "up_sampling2d_1"}, {"config": {"trainable": true, "name": "concatenate_1", "axis": 1}, "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}], ["activation_6", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_1"}, {"config": {"rate": 0.5, "noise_shape": null, "trainable": true, "name": "dropout_1", "seed": null}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_1"}, {"config": {"strides": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_9", "data_format": "channels_first", "padding": "same"}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_9"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_9"}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "class_name": "Activation", "name": "activation_9"}, {"config": {"strides": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_10", "data_format": "channels_first", "padding": "same"}, "inbound_nodes": [[["activation_9", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_10"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_10"}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "class_name": "Activation", "name": "activation_10"}, {"config": {"size": [2, 2], "trainable": true, "name": "up_sampling2d_2", "data_format": "channels_first"}, "inbound_nodes": [[["activation_10", 0, 0, {}]]], "class_name": "UpSampling2D", "name": "up_sampling2d_2"}, {"config": {"trainable": true, "name": "concatenate_2", "axis": 1}, "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}], ["activation_4", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_2"}, {"config": {"rate": 0.5, "noise_shape": null, "trainable": true, "name": "dropout_2", "seed": null}, "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_2"}, {"config": {"strides": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_11", "data_format": "channels_first", "padding": "same"}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_11"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_11"}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "class_name": "Activation", "name": "activation_11"}, {"config": {"strides": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_12", "data_format": "channels_first", "padding": "same"}, "inbound_nodes": [[["activation_11", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_12"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_12"}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "class_name": "Activation", "name": "activation_12"}, {"config": {"size": [2, 2], "trainable": true, "name": "up_sampling2d_3", "data_format": "channels_first"}, "inbound_nodes": [[["activation_12", 0, 0, {}]]], "class_name": "UpSampling2D", "name": "up_sampling2d_3"}, {"config": {"trainable": true, "name": "concatenate_3", "axis": 1}, "inbound_nodes": [[["up_sampling2d_3", 0, 0, {}], ["activation_2", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_3"}, {"config": {"rate": 0.5, "noise_shape": null, "trainable": true, "name": "dropout_3", "seed": null}, "inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_3"}, {"config": {"strides": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "filters": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_13", "data_format": "channels_first", "padding": "same"}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_13"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_13"}, "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "class_name": "Activation", "name": "activation_13"}, {"config": {"strides": [1, 1], "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "filters": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_14", "data_format": "channels_first", "padding": "same"}, "inbound_nodes": [[["activation_13", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_14"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_14"}, "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "class_name": "Activation", "name": "activation_14"}, {"config": {"strides": [1, 1], "activity_regularizer": null, "kernel_size": [1, 1], "activation": "linear", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "filters": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_15", "data_format": "channels_first", "padding": "valid"}, "inbound_nodes": [[["activation_14", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_15"}, {"config": {"activation": "sigmoid", "trainable": true, "name": "activation_15"}, "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "class_name": "Activation", "name": "activation_15"}], "name": "generator", "output_layers": [["activation_15", 0, 0]]}, "class_name": "Model", "keras_version": "2.0.9", "backend": "tensorflow"}