{"backend": "tensorflow", "keras_version": "2.0.9", "config": {"name": "model_1", "output_layers": [["activation_19", 0, 0]], "input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "inbound_nodes": [], "config": {"batch_input_shape": [null, 1, 128, 128], "sparse": false, "name": "input_1", "dtype": "float32"}, "class_name": "InputLayer"}, {"name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"activation": "linear", "use_bias": true, "padding": "same", "name": "conv2d_1", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_first", "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "trainable": true, "filters": 16, "bias_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"name": "activation_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"name": "conv2d_2", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"activation": "linear", "use_bias": true, "padding": "same", "name": "conv2d_2", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_first", "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "trainable": true, "filters": 16, "bias_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"name": "activation_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_2", "trainable": true}, "class_name": "Activation"}, {"name": "max_pooling2d_1", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"strides": [2, 2], "name": "max_pooling2d_1", "padding": "valid", "pool_size": [2, 2], "data_format": "channels_first", "trainable": true}, "class_name": "MaxPooling2D"}, {"name": "conv2d_3", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"activation": "linear", "use_bias": true, "padding": "same", "name": "conv2d_3", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_first", "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "trainable": true, "filters": 32, "bias_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"name": "activation_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_3", "trainable": true}, "class_name": "Activation"}, {"name": "conv2d_4", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"activation": "linear", "use_bias": true, "padding": "same", "name": "conv2d_4", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_first", "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "trainable": true, "filters": 32, "bias_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"name": "activation_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_4", "trainable": true}, "class_name": "Activation"}, {"name": "max_pooling2d_2", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"strides": [2, 2], "name": "max_pooling2d_2", "padding": "valid", "pool_size": [2, 2], "data_format": "channels_first", "trainable": true}, "class_name": "MaxPooling2D"}, {"name": "conv2d_5", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"activation": "linear", "use_bias": true, "padding": "same", "name": "conv2d_5", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_first", "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "trainable": true, "filters": 64, "bias_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"name": "activation_5", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_5", "trainable": true}, "class_name": "Activation"}, {"name": "conv2d_6", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "config": {"activation": "linear", "use_bias": true, "padding": "same", "name": "conv2d_6", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_first", "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "trainable": true, "filters": 64, "bias_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"name": "activation_6", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_6", "trainable": true}, "class_name": "Activation"}, {"name": "max_pooling2d_3", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "config": {"strides": [2, 2], "name": "max_pooling2d_3", "padding": "valid", "pool_size": [2, 2], "data_format": "channels_first", "trainable": true}, "class_name": "MaxPooling2D"}, {"name": "conv2d_7", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "config": {"activation": "linear", "use_bias": true, "padding": "same", "name": "conv2d_7", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_first", "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "trainable": true, "filters": 128, "bias_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"name": "activation_7", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_7", "trainable": true}, "class_name": "Activation"}, {"name": "conv2d_8", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "config": {"activation": "linear", "use_bias": true, "padding": "same", "name": "conv2d_8", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_first", "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "trainable": true, "filters": 128, "bias_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"name": "activation_8", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_8", "trainable": true}, "class_name": "Activation"}, {"name": "max_pooling2d_4", "inbound_nodes": [[["activation_8", 0, 0, {}]]], "config": {"strides": [2, 2], "name": "max_pooling2d_4", "padding": "valid", "pool_size": [2, 2], "data_format": "channels_first", "trainable": true}, "class_name": "MaxPooling2D"}, {"name": "conv2d_9", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "config": {"activation": "linear", "use_bias": true, "padding": "same", "name": "conv2d_9", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_first", "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "trainable": true, "filters": 256, "bias_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"name": "activation_9", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_9", "trainable": true}, "class_name": "Activation"}, {"name": "conv2d_10", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "config": {"activation": "linear", "use_bias": true, "padding": "same", "name": "conv2d_10", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_first", "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "trainable": true, "filters": 256, "bias_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"name": "activation_10", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_10", "trainable": true}, "class_name": "Activation"}, {"name": "up_sampling2d_1", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "config": {"name": "up_sampling2d_1", "data_format": "channels_first", "trainable": true, "size": [2, 2]}, "class_name": "UpSampling2D"}, {"name": "concatenate_1", "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}], ["activation_8", 0, 0, {}]]], "config": {"name": "concatenate_1", "axis": 1, "trainable": true}, "class_name": "Concatenate"}, {"name": "conv2d_11", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "config": {"activation": "linear", "use_bias": true, "padding": "same", "name": "conv2d_11", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_first", "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "trainable": true, "filters": 128, "bias_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"name": "activation_11", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_11", "trainable": true}, "class_name": "Activation"}, {"name": "conv2d_12", "inbound_nodes": [[["activation_11", 0, 0, {}]]], "config": {"activation": "linear", "use_bias": true, "padding": "same", "name": "conv2d_12", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_first", "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "trainable": true, "filters": 128, "bias_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"name": "activation_12", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_12", "trainable": true}, "class_name": "Activation"}, {"name": "up_sampling2d_2", "inbound_nodes": [[["activation_12", 0, 0, {}]]], "config": {"name": "up_sampling2d_2", "data_format": "channels_first", "trainable": true, "size": [2, 2]}, "class_name": "UpSampling2D"}, {"name": "concatenate_2", "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}], ["activation_6", 0, 0, {}]]], "config": {"name": "concatenate_2", "axis": 1, "trainable": true}, "class_name": "Concatenate"}, {"name": "conv2d_13", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "config": {"activation": "linear", "use_bias": true, "padding": "same", "name": "conv2d_13", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_first", "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "trainable": true, "filters": 64, "bias_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"name": "activation_13", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_13", "trainable": true}, "class_name": "Activation"}, {"name": "conv2d_14", "inbound_nodes": [[["activation_13", 0, 0, {}]]], "config": {"activation": "linear", "use_bias": true, "padding": "same", "name": "conv2d_14", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_first", "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "trainable": true, "filters": 64, "bias_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"name": "activation_14", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_14", "trainable": true}, "class_name": "Activation"}, {"name": "up_sampling2d_3", "inbound_nodes": [[["activation_14", 0, 0, {}]]], "config": {"name": "up_sampling2d_3", "data_format": "channels_first", "trainable": true, "size": [2, 2]}, "class_name": "UpSampling2D"}, {"name": "concatenate_3", "inbound_nodes": [[["up_sampling2d_3", 0, 0, {}], ["activation_4", 0, 0, {}]]], "config": {"name": "concatenate_3", "axis": 1, "trainable": true}, "class_name": "Concatenate"}, {"name": "conv2d_15", "inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "config": {"activation": "linear", "use_bias": true, "padding": "same", "name": "conv2d_15", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_first", "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "trainable": true, "filters": 32, "bias_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"name": "activation_15", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_15", "trainable": true}, "class_name": "Activation"}, {"name": "conv2d_16", "inbound_nodes": [[["activation_15", 0, 0, {}]]], "config": {"activation": "linear", "use_bias": true, "padding": "same", "name": "conv2d_16", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_first", "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "trainable": true, "filters": 32, "bias_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"name": "activation_16", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_16", "trainable": true}, "class_name": "Activation"}, {"name": "up_sampling2d_4", "inbound_nodes": [[["activation_16", 0, 0, {}]]], "config": {"name": "up_sampling2d_4", "data_format": "channels_first", "trainable": true, "size": [2, 2]}, "class_name": "UpSampling2D"}, {"name": "concatenate_4", "inbound_nodes": [[["up_sampling2d_4", 0, 0, {}], ["activation_2", 0, 0, {}]]], "config": {"name": "concatenate_4", "axis": 1, "trainable": true}, "class_name": "Concatenate"}, {"name": "conv2d_17", "inbound_nodes": [[["concatenate_4", 0, 0, {}]]], "config": {"activation": "linear", "use_bias": true, "padding": "same", "name": "conv2d_17", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_first", "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "trainable": true, "filters": 16, "bias_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"name": "activation_17", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_17", "trainable": true}, "class_name": "Activation"}, {"name": "conv2d_18", "inbound_nodes": [[["activation_17", 0, 0, {}]]], "config": {"activation": "linear", "use_bias": true, "padding": "same", "name": "conv2d_18", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_first", "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "trainable": true, "filters": 16, "bias_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"name": "activation_18", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_18", "trainable": true}, "class_name": "Activation"}, {"name": "conv2d_19", "inbound_nodes": [[["activation_18", 0, 0, {}]]], "config": {"activation": "linear", "use_bias": true, "padding": "valid", "name": "conv2d_19", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_first", "kernel_size": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "trainable": true, "filters": 2, "bias_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"name": "activation_19", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "config": {"activation": "sigmoid", "name": "activation_19", "trainable": true}, "class_name": "Activation"}]}, "class_name": "Model"}