{"config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["activation_19", 0, 0]], "layers": [{"config": {"sparse": false, "batch_input_shape": [null, 1, 128, 128], "dtype": "float32", "name": "input_1"}, "inbound_nodes": [], "class_name": "InputLayer", "name": "input_1"}, {"config": {"filters": 16, "strides": [1, 1], "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "name": "conv2d_1", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true, "data_format": "channels_first"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_1"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "Activation", "name": "activation_1"}, {"config": {"filters": 16, "strides": [1, 1], "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "name": "conv2d_2", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true, "data_format": "channels_first"}, "inbound_nodes": [[["activation_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_2"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "Activation", "name": "activation_2"}, {"config": {"strides": [2, 2], "trainable": true, "padding": "valid", "name": "max_pooling2d_1", "pool_size": [2, 2], "data_format": "channels_first"}, "inbound_nodes": [[["activation_2", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_1"}, {"config": {"filters": 32, "strides": [1, 1], "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "name": "conv2d_3", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true, "data_format": "channels_first"}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_3"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_3"}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "Activation", "name": "activation_3"}, {"config": {"filters": 32, "strides": [1, 1], "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "name": "conv2d_4", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true, "data_format": "channels_first"}, "inbound_nodes": [[["activation_3", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_4"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_4"}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "Activation", "name": "activation_4"}, {"config": {"strides": [2, 2], "trainable": true, "padding": "valid", "name": "max_pooling2d_2", "pool_size": [2, 2], "data_format": "channels_first"}, "inbound_nodes": [[["activation_4", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_2"}, {"config": {"filters": 64, "strides": [1, 1], "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "name": "conv2d_5", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true, "data_format": "channels_first"}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_5"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_5"}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "Activation", "name": "activation_5"}, {"config": {"filters": 64, "strides": [1, 1], "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "name": "conv2d_6", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true, "data_format": "channels_first"}, "inbound_nodes": [[["activation_5", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_6"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_6"}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "class_name": "Activation", "name": "activation_6"}, {"config": {"strides": [2, 2], "trainable": true, "padding": "valid", "name": "max_pooling2d_3", "pool_size": [2, 2], "data_format": "channels_first"}, "inbound_nodes": [[["activation_6", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_3"}, {"config": {"filters": 128, "strides": [1, 1], "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "name": "conv2d_7", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true, "data_format": "channels_first"}, "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_7"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_7"}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "class_name": "Activation", "name": "activation_7"}, {"config": {"filters": 128, "strides": [1, 1], "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "name": "conv2d_8", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true, "data_format": "channels_first"}, "inbound_nodes": [[["activation_7", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_8"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_8"}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "class_name": "Activation", "name": "activation_8"}, {"config": {"strides": [2, 2], "trainable": true, "padding": "valid", "name": "max_pooling2d_4", "pool_size": [2, 2], "data_format": "channels_first"}, "inbound_nodes": [[["activation_8", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_4"}, {"config": {"filters": 256, "strides": [1, 1], "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "name": "conv2d_9", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true, "data_format": "channels_first"}, "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_9"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_9"}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "class_name": "Activation", "name": "activation_9"}, {"config": {"filters": 256, "strides": [1, 1], "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "name": "conv2d_10", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true, "data_format": "channels_first"}, "inbound_nodes": [[["activation_9", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_10"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_10"}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "class_name": "Activation", "name": "activation_10"}, {"config": {"name": "up_sampling2d_1", "trainable": true, "data_format": "channels_first", "size": [2, 2]}, "inbound_nodes": [[["activation_10", 0, 0, {}]]], "class_name": "UpSampling2D", "name": "up_sampling2d_1"}, {"config": {"name": "concatenate_1", "trainable": true, "axis": 1}, "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}], ["activation_8", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_1"}, {"config": {"filters": 128, "strides": [1, 1], "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "name": "conv2d_11", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true, "data_format": "channels_first"}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_11"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_11"}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "class_name": "Activation", "name": "activation_11"}, {"config": {"filters": 128, "strides": [1, 1], "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "name": "conv2d_12", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true, "data_format": "channels_first"}, "inbound_nodes": [[["activation_11", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_12"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_12"}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "class_name": "Activation", "name": "activation_12"}, {"config": {"name": "up_sampling2d_2", "trainable": true, "data_format": "channels_first", "size": [2, 2]}, "inbound_nodes": [[["activation_12", 0, 0, {}]]], "class_name": "UpSampling2D", "name": "up_sampling2d_2"}, {"config": {"name": "concatenate_2", "trainable": true, "axis": 1}, "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}], ["activation_6", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_2"}, {"config": {"filters": 64, "strides": [1, 1], "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "name": "conv2d_13", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true, "data_format": "channels_first"}, "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_13"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_13"}, "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "class_name": "Activation", "name": "activation_13"}, {"config": {"filters": 64, "strides": [1, 1], "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "name": "conv2d_14", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true, "data_format": "channels_first"}, "inbound_nodes": [[["activation_13", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_14"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_14"}, "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "class_name": "Activation", "name": "activation_14"}, {"config": {"name": "up_sampling2d_3", "trainable": true, "data_format": "channels_first", "size": [2, 2]}, "inbound_nodes": [[["activation_14", 0, 0, {}]]], "class_name": "UpSampling2D", "name": "up_sampling2d_3"}, {"config": {"name": "concatenate_3", "trainable": true, "axis": 1}, "inbound_nodes": [[["up_sampling2d_3", 0, 0, {}], ["activation_4", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_3"}, {"config": {"filters": 32, "strides": [1, 1], "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "name": "conv2d_15", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true, "data_format": "channels_first"}, "inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_15"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_15"}, "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "class_name": "Activation", "name": "activation_15"}, {"config": {"filters": 32, "strides": [1, 1], "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "name": "conv2d_16", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true, "data_format": "channels_first"}, "inbound_nodes": [[["activation_15", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_16"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_16"}, "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "class_name": "Activation", "name": "activation_16"}, {"config": {"name": "up_sampling2d_4", "trainable": true, "data_format": "channels_first", "size": [2, 2]}, "inbound_nodes": [[["activation_16", 0, 0, {}]]], "class_name": "UpSampling2D", "name": "up_sampling2d_4"}, {"config": {"name": "concatenate_4", "trainable": true, "axis": 1}, "inbound_nodes": [[["up_sampling2d_4", 0, 0, {}], ["activation_2", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_4"}, {"config": {"filters": 16, "strides": [1, 1], "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "name": "conv2d_17", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true, "data_format": "channels_first"}, "inbound_nodes": [[["concatenate_4", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_17"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_17"}, "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "class_name": "Activation", "name": "activation_17"}, {"config": {"filters": 16, "strides": [1, 1], "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "name": "conv2d_18", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true, "data_format": "channels_first"}, "inbound_nodes": [[["activation_17", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_18"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_18"}, "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "class_name": "Activation", "name": "activation_18"}, {"config": {"filters": 2, "strides": [1, 1], "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "padding": "valid", "name": "conv2d_19", "dilation_rate": [1, 1], "kernel_size": [1, 1], "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true, "data_format": "channels_first"}, "inbound_nodes": [[["activation_18", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_19"}, {"config": {"trainable": true, "activation": "sigmoid", "name": "activation_19"}, "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "class_name": "Activation", "name": "activation_19"}]}, "keras_version": "2.0.9", "class_name": "Model", "backend": "tensorflow"}