{"keras_version": "2.0.9", "config": {"layers": [{"inbound_nodes": [], "name": "input_1", "class_name": "InputLayer", "config": {"name": "input_1", "dtype": "float32", "batch_input_shape": [null, 1, 128, 128], "sparse": false}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_1", "kernel_regularizer": null, "activation": "linear", "padding": "same", "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3], "filters": 16, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "data_format": "channels_first", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "activation_1", "class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"inbound_nodes": [[["activation_1", 0, 0, {}]]], "name": "conv2d_2", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_2", "kernel_regularizer": null, "activation": "linear", "padding": "same", "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3], "filters": 16, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "data_format": "channels_first", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "activation_2", "class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"inbound_nodes": [[["activation_2", 0, 0, {}]]], "name": "max_pooling2d_1", "class_name": "MaxPooling2D", "config": {"trainable": true, "name": "max_pooling2d_1", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "conv2d_3", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_3", "kernel_regularizer": null, "activation": "linear", "padding": "same", "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3], "filters": 32, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "data_format": "channels_first", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "activation_3", "class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"inbound_nodes": [[["activation_3", 0, 0, {}]]], "name": "conv2d_4", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_4", "kernel_regularizer": null, "activation": "linear", "padding": "same", "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3], "filters": 32, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "data_format": "channels_first", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "activation_4", "class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "max_pooling2d_2", "class_name": "MaxPooling2D", "config": {"trainable": true, "name": "max_pooling2d_2", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "conv2d_5", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_5", "kernel_regularizer": null, "activation": "linear", "padding": "same", "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3], "filters": 64, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "data_format": "channels_first", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "activation_5", "class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"inbound_nodes": [[["activation_5", 0, 0, {}]]], "name": "conv2d_6", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_6", "kernel_regularizer": null, "activation": "linear", "padding": "same", "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3], "filters": 64, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "data_format": "channels_first", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "activation_6", "class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}}, {"inbound_nodes": [[["activation_6", 0, 0, {}]]], "name": "max_pooling2d_3", "class_name": "MaxPooling2D", "config": {"trainable": true, "name": "max_pooling2d_3", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}}, {"inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "name": "conv2d_7", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_7", "kernel_regularizer": null, "activation": "linear", "padding": "same", "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3], "filters": 128, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "data_format": "channels_first", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "name": "activation_7", "class_name": "Activation", "config": {"trainable": true, "name": "activation_7", "activation": "relu"}}, {"inbound_nodes": [[["activation_7", 0, 0, {}]]], "name": "conv2d_8", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_8", "kernel_regularizer": null, "activation": "linear", "padding": "same", "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3], "filters": 128, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "data_format": "channels_first", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "name": "activation_8", "class_name": "Activation", "config": {"trainable": true, "name": "activation_8", "activation": "relu"}}, {"inbound_nodes": [[["activation_8", 0, 0, {}]]], "name": "max_pooling2d_4", "class_name": "MaxPooling2D", "config": {"trainable": true, "name": "max_pooling2d_4", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}}, {"inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "name": "conv2d_9", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_9", "kernel_regularizer": null, "activation": "linear", "padding": "same", "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3], "filters": 256, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "data_format": "channels_first", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "name": "activation_9", "class_name": "Activation", "config": {"trainable": true, "name": "activation_9", "activation": "relu"}}, {"inbound_nodes": [[["activation_9", 0, 0, {}]]], "name": "conv2d_10", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_10", "kernel_regularizer": null, "activation": "linear", "padding": "same", "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3], "filters": 256, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "data_format": "channels_first", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "name": "activation_10", "class_name": "Activation", "config": {"trainable": true, "name": "activation_10", "activation": "relu"}}, {"inbound_nodes": [[["activation_10", 0, 0, {}]]], "name": "up_sampling2d_1", "class_name": "UpSampling2D", "config": {"trainable": true, "name": "up_sampling2d_1", "size": [2, 2], "data_format": "channels_first"}}, {"inbound_nodes": [[["up_sampling2d_1", 0, 0, {}], ["activation_8", 0, 0, {}]]], "name": "concatenate_1", "class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_1", "axis": 1}}, {"inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "name": "conv2d_11", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_11", "kernel_regularizer": null, "activation": "linear", "padding": "same", "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3], "filters": 128, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "data_format": "channels_first", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "name": "activation_11", "class_name": "Activation", "config": {"trainable": true, "name": "activation_11", "activation": "relu"}}, {"inbound_nodes": [[["activation_11", 0, 0, {}]]], "name": "conv2d_12", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_12", "kernel_regularizer": null, "activation": "linear", "padding": "same", "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3], "filters": 128, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "data_format": "channels_first", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "name": "activation_12", "class_name": "Activation", "config": {"trainable": true, "name": "activation_12", "activation": "relu"}}, {"inbound_nodes": [[["activation_12", 0, 0, {}]]], "name": "up_sampling2d_2", "class_name": "UpSampling2D", "config": {"trainable": true, "name": "up_sampling2d_2", "size": [2, 2], "data_format": "channels_first"}}, {"inbound_nodes": [[["up_sampling2d_2", 0, 0, {}], ["activation_6", 0, 0, {}]]], "name": "concatenate_2", "class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_2", "axis": 1}}, {"inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "name": "conv2d_13", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_13", "kernel_regularizer": null, "activation": "linear", "padding": "same", "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3], "filters": 64, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "data_format": "channels_first", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "name": "activation_13", "class_name": "Activation", "config": {"trainable": true, "name": "activation_13", "activation": "relu"}}, {"inbound_nodes": [[["activation_13", 0, 0, {}]]], "name": "conv2d_14", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_14", "kernel_regularizer": null, "activation": "linear", "padding": "same", "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3], "filters": 64, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "data_format": "channels_first", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "name": "activation_14", "class_name": "Activation", "config": {"trainable": true, "name": "activation_14", "activation": "relu"}}, {"inbound_nodes": [[["activation_14", 0, 0, {}]]], "name": "up_sampling2d_3", "class_name": "UpSampling2D", "config": {"trainable": true, "name": "up_sampling2d_3", "size": [2, 2], "data_format": "channels_first"}}, {"inbound_nodes": [[["up_sampling2d_3", 0, 0, {}], ["activation_4", 0, 0, {}]]], "name": "concatenate_3", "class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_3", "axis": 1}}, {"inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "name": "conv2d_15", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_15", "kernel_regularizer": null, "activation": "linear", "padding": "same", "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3], "filters": 32, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "data_format": "channels_first", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "name": "activation_15", "class_name": "Activation", "config": {"trainable": true, "name": "activation_15", "activation": "relu"}}, {"inbound_nodes": [[["activation_15", 0, 0, {}]]], "name": "conv2d_16", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_16", "kernel_regularizer": null, "activation": "linear", "padding": "same", "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3], "filters": 32, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "data_format": "channels_first", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "name": "activation_16", "class_name": "Activation", "config": {"trainable": true, "name": "activation_16", "activation": "relu"}}, {"inbound_nodes": [[["activation_16", 0, 0, {}]]], "name": "up_sampling2d_4", "class_name": "UpSampling2D", "config": {"trainable": true, "name": "up_sampling2d_4", "size": [2, 2], "data_format": "channels_first"}}, {"inbound_nodes": [[["up_sampling2d_4", 0, 0, {}], ["activation_2", 0, 0, {}]]], "name": "concatenate_4", "class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_4", "axis": 1}}, {"inbound_nodes": [[["concatenate_4", 0, 0, {}]]], "name": "conv2d_17", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_17", "kernel_regularizer": null, "activation": "linear", "padding": "same", "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3], "filters": 16, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "data_format": "channels_first", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "name": "activation_17", "class_name": "Activation", "config": {"trainable": true, "name": "activation_17", "activation": "relu"}}, {"inbound_nodes": [[["activation_17", 0, 0, {}]]], "name": "conv2d_18", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_18", "kernel_regularizer": null, "activation": "linear", "padding": "same", "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3], "filters": 16, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "data_format": "channels_first", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "name": "activation_18", "class_name": "Activation", "config": {"trainable": true, "name": "activation_18", "activation": "relu"}}, {"inbound_nodes": [[["activation_18", 0, 0, {}]]], "name": "conv2d_19", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_19", "kernel_regularizer": null, "activation": "linear", "padding": "valid", "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1], "filters": 2, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "strides": [1, 1], "kernel_constraint": null, "data_format": "channels_first", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "name": "activation_19", "class_name": "Activation", "config": {"trainable": true, "name": "activation_19", "activation": "sigmoid"}}], "name": "model_1", "output_layers": [["activation_19", 0, 0]], "input_layers": [["input_1", 0, 0]]}, "class_name": "Model", "backend": "tensorflow"}