{"keras_version": "2.0.9", "class_name": "Model", "config": {"output_layers": [["activation_15", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 2, 128, 128], "sparse": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "data_format": "channels_first", "filters": 16, "activation": "linear", "bias_regularizer": null, "use_bias": true, "name": "conv2d_1", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "activity_regularizer": null, "trainable": true}, "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "name": "activation_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "data_format": "channels_first", "filters": 16, "activation": "linear", "bias_regularizer": null, "use_bias": true, "name": "conv2d_2", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "activity_regularizer": null, "trainable": true}, "name": "conv2d_2", "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "name": "activation_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "max_pooling2d_1", "strides": [2, 2], "data_format": "channels_first", "pool_size": [2, 2], "trainable": true}, "name": "max_pooling2d_1", "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "data_format": "channels_first", "filters": 32, "activation": "linear", "bias_regularizer": null, "use_bias": true, "name": "conv2d_3", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "activity_regularizer": null, "trainable": true}, "name": "conv2d_3", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "name": "activation_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "data_format": "channels_first", "filters": 32, "activation": "linear", "bias_regularizer": null, "use_bias": true, "name": "conv2d_4", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "activity_regularizer": null, "trainable": true}, "name": "conv2d_4", "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "name": "activation_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "max_pooling2d_2", "strides": [2, 2], "data_format": "channels_first", "pool_size": [2, 2], "trainable": true}, "name": "max_pooling2d_2", "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "data_format": "channels_first", "filters": 64, "activation": "linear", "bias_regularizer": null, "use_bias": true, "name": "conv2d_5", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "activity_regularizer": null, "trainable": true}, "name": "conv2d_5", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}, "name": "activation_5", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "data_format": "channels_first", "filters": 64, "activation": "linear", "bias_regularizer": null, "use_bias": true, "name": "conv2d_6", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "activity_regularizer": null, "trainable": true}, "name": "conv2d_6", "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}, "name": "activation_6", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "max_pooling2d_3", "strides": [2, 2], "data_format": "channels_first", "pool_size": [2, 2], "trainable": true}, "name": "max_pooling2d_3", "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "data_format": "channels_first", "filters": 128, "activation": "linear", "bias_regularizer": null, "use_bias": true, "name": "conv2d_7", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "activity_regularizer": null, "trainable": true}, "name": "conv2d_7", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_7", "activation": "relu"}, "name": "activation_7", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "data_format": "channels_first", "filters": 128, "activation": "linear", "bias_regularizer": null, "use_bias": true, "name": "conv2d_8", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "activity_regularizer": null, "trainable": true}, "name": "conv2d_8", "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_8", "activation": "relu"}, "name": "activation_8", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"size": [2, 2], "data_format": "channels_first", "name": "up_sampling2d_1", "trainable": true}, "name": "up_sampling2d_1", "inbound_nodes": [[["activation_8", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"axis": 1, "name": "concatenate_1", "trainable": true}, "name": "concatenate_1", "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}], ["activation_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "data_format": "channels_first", "filters": 64, "activation": "linear", "bias_regularizer": null, "use_bias": true, "name": "conv2d_9", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "activity_regularizer": null, "trainable": true}, "name": "conv2d_9", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_9", "activation": "relu"}, "name": "activation_9", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "data_format": "channels_first", "filters": 64, "activation": "linear", "bias_regularizer": null, "use_bias": true, "name": "conv2d_10", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "activity_regularizer": null, "trainable": true}, "name": "conv2d_10", "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_10", "activation": "relu"}, "name": "activation_10", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"size": [2, 2], "data_format": "channels_first", "name": "up_sampling2d_2", "trainable": true}, "name": "up_sampling2d_2", "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"axis": 1, "name": "concatenate_2", "trainable": true}, "name": "concatenate_2", "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}], ["activation_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "data_format": "channels_first", "filters": 32, "activation": "linear", "bias_regularizer": null, "use_bias": true, "name": "conv2d_11", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "activity_regularizer": null, "trainable": true}, "name": "conv2d_11", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_11", "activation": "relu"}, "name": "activation_11", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "data_format": "channels_first", "filters": 32, "activation": "linear", "bias_regularizer": null, "use_bias": true, "name": "conv2d_12", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "activity_regularizer": null, "trainable": true}, "name": "conv2d_12", "inbound_nodes": [[["activation_11", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_12", "activation": "relu"}, "name": "activation_12", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"size": [2, 2], "data_format": "channels_first", "name": "up_sampling2d_3", "trainable": true}, "name": "up_sampling2d_3", "inbound_nodes": [[["activation_12", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"axis": 1, "name": "concatenate_3", "trainable": true}, "name": "concatenate_3", "inbound_nodes": [[["up_sampling2d_3", 0, 0, {}], ["activation_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "data_format": "channels_first", "filters": 16, "activation": "linear", "bias_regularizer": null, "use_bias": true, "name": "conv2d_13", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "activity_regularizer": null, "trainable": true}, "name": "conv2d_13", "inbound_nodes": [[["concatenate_3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_13", "activation": "relu"}, "name": "activation_13", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "data_format": "channels_first", "filters": 16, "activation": "linear", "bias_regularizer": null, "use_bias": true, "name": "conv2d_14", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "activity_regularizer": null, "trainable": true}, "name": "conv2d_14", "inbound_nodes": [[["activation_13", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_14", "activation": "relu"}, "name": "activation_14", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "valid", "kernel_regularizer": null, "data_format": "channels_first", "filters": 1, "activation": "linear", "bias_regularizer": null, "use_bias": true, "name": "conv2d_15", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "activity_regularizer": null, "trainable": true}, "name": "conv2d_15", "inbound_nodes": [[["activation_14", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_15", "activation": "sigmoid"}, "name": "activation_15", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]]}, "backend": "tensorflow"}