{"keras_version": "2.0.9", "class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["activation_19", 0, 0]], "name": "model_1", "layers": [{"inbound_nodes": [], "name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 128, 128], "name": "input_1", "dtype": "float32", "sparse": false}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_1", "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "data_format": "channels_first", "activation": "linear", "strides": [1, 1]}}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "activation_1", "class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"inbound_nodes": [[["activation_1", 0, 0, {}]]], "name": "conv2d_2", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_2", "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "data_format": "channels_first", "activation": "linear", "strides": [1, 1]}}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "activation_2", "class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"inbound_nodes": [[["activation_2", 0, 0, {}]]], "name": "max_pooling2d_1", "class_name": "MaxPooling2D", "config": {"trainable": true, "name": "max_pooling2d_1", "pool_size": [2, 2], "data_format": "channels_first", "strides": [2, 2], "padding": "valid"}}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "conv2d_3", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_3", "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "data_format": "channels_first", "activation": "linear", "strides": [1, 1]}}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "activation_3", "class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"inbound_nodes": [[["activation_3", 0, 0, {}]]], "name": "conv2d_4", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_4", "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "data_format": "channels_first", "activation": "linear", "strides": [1, 1]}}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "activation_4", "class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "max_pooling2d_2", "class_name": "MaxPooling2D", "config": {"trainable": true, "name": "max_pooling2d_2", "pool_size": [2, 2], "data_format": "channels_first", "strides": [2, 2], "padding": "valid"}}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "conv2d_5", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_5", "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "data_format": "channels_first", "activation": "linear", "strides": [1, 1]}}, {"inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "activation_5", "class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"inbound_nodes": [[["activation_5", 0, 0, {}]]], "name": "conv2d_6", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_6", "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "data_format": "channels_first", "activation": "linear", "strides": [1, 1]}}, {"inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "activation_6", "class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}}, {"inbound_nodes": [[["activation_6", 0, 0, {}]]], "name": "max_pooling2d_3", "class_name": "MaxPooling2D", "config": {"trainable": true, "name": "max_pooling2d_3", "pool_size": [2, 2], "data_format": "channels_first", "strides": [2, 2], "padding": "valid"}}, {"inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "name": "conv2d_7", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_7", "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "data_format": "channels_first", "activation": "linear", "strides": [1, 1]}}, {"inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "name": "activation_7", "class_name": "Activation", "config": {"trainable": true, "name": "activation_7", "activation": "relu"}}, {"inbound_nodes": [[["activation_7", 0, 0, {}]]], "name": "conv2d_8", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_8", "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "data_format": "channels_first", "activation": "linear", "strides": [1, 1]}}, {"inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "name": "activation_8", "class_name": "Activation", "config": {"trainable": true, "name": "activation_8", "activation": "relu"}}, {"inbound_nodes": [[["activation_8", 0, 0, {}]]], "name": "max_pooling2d_4", "class_name": "MaxPooling2D", "config": {"trainable": true, "name": "max_pooling2d_4", "pool_size": [2, 2], "data_format": "channels_first", "strides": [2, 2], "padding": "valid"}}, {"inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "name": "conv2d_9", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_9", "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "data_format": "channels_first", "activation": "linear", "strides": [1, 1]}}, {"inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "name": "activation_9", "class_name": "Activation", "config": {"trainable": true, "name": "activation_9", "activation": "relu"}}, {"inbound_nodes": [[["activation_9", 0, 0, {}]]], "name": "conv2d_10", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_10", "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "data_format": "channels_first", "activation": "linear", "strides": [1, 1]}}, {"inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "name": "activation_10", "class_name": "Activation", "config": {"trainable": true, "name": "activation_10", "activation": "relu"}}, {"inbound_nodes": [[["activation_10", 0, 0, {}]]], "name": "up_sampling2d_1", "class_name": "UpSampling2D", "config": {"data_format": "channels_first", "size": [2, 2], "trainable": true, "name": "up_sampling2d_1"}}, {"inbound_nodes": [[["up_sampling2d_1", 0, 0, {}], ["activation_8", 0, 0, {}]]], "name": "concatenate_1", "class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_1", "axis": 1}}, {"inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "name": "conv2d_11", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_11", "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "data_format": "channels_first", "activation": "linear", "strides": [1, 1]}}, {"inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "name": "activation_11", "class_name": "Activation", "config": {"trainable": true, "name": "activation_11", "activation": "relu"}}, {"inbound_nodes": [[["activation_11", 0, 0, {}]]], "name": "conv2d_12", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_12", "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "data_format": "channels_first", "activation": "linear", "strides": [1, 1]}}, {"inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "name": "activation_12", "class_name": "Activation", "config": {"trainable": true, "name": "activation_12", "activation": "relu"}}, {"inbound_nodes": [[["activation_12", 0, 0, {}]]], "name": "up_sampling2d_2", "class_name": "UpSampling2D", "config": {"data_format": "channels_first", "size": [2, 2], "trainable": true, "name": "up_sampling2d_2"}}, {"inbound_nodes": [[["up_sampling2d_2", 0, 0, {}], ["activation_6", 0, 0, {}]]], "name": "concatenate_2", "class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_2", "axis": 1}}, {"inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "name": "conv2d_13", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_13", "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "data_format": "channels_first", "activation": "linear", "strides": [1, 1]}}, {"inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "name": "activation_13", "class_name": "Activation", "config": {"trainable": true, "name": "activation_13", "activation": "relu"}}, {"inbound_nodes": [[["activation_13", 0, 0, {}]]], "name": "conv2d_14", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_14", "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "data_format": "channels_first", "activation": "linear", "strides": [1, 1]}}, {"inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "name": "activation_14", "class_name": "Activation", "config": {"trainable": true, "name": "activation_14", "activation": "relu"}}, {"inbound_nodes": [[["activation_14", 0, 0, {}]]], "name": "up_sampling2d_3", "class_name": "UpSampling2D", "config": {"data_format": "channels_first", "size": [2, 2], "trainable": true, "name": "up_sampling2d_3"}}, {"inbound_nodes": [[["up_sampling2d_3", 0, 0, {}], ["activation_4", 0, 0, {}]]], "name": "concatenate_3", "class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_3", "axis": 1}}, {"inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "name": "conv2d_15", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_15", "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "data_format": "channels_first", "activation": "linear", "strides": [1, 1]}}, {"inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "name": "activation_15", "class_name": "Activation", "config": {"trainable": true, "name": "activation_15", "activation": "relu"}}, {"inbound_nodes": [[["activation_15", 0, 0, {}]]], "name": "conv2d_16", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_16", "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "data_format": "channels_first", "activation": "linear", "strides": [1, 1]}}, {"inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "name": "activation_16", "class_name": "Activation", "config": {"trainable": true, "name": "activation_16", "activation": "relu"}}, {"inbound_nodes": [[["activation_16", 0, 0, {}]]], "name": "up_sampling2d_4", "class_name": "UpSampling2D", "config": {"data_format": "channels_first", "size": [2, 2], "trainable": true, "name": "up_sampling2d_4"}}, {"inbound_nodes": [[["up_sampling2d_4", 0, 0, {}], ["activation_2", 0, 0, {}]]], "name": "concatenate_4", "class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_4", "axis": 1}}, {"inbound_nodes": [[["concatenate_4", 0, 0, {}]]], "name": "conv2d_17", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_17", "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "data_format": "channels_first", "activation": "linear", "strides": [1, 1]}}, {"inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "name": "activation_17", "class_name": "Activation", "config": {"trainable": true, "name": "activation_17", "activation": "relu"}}, {"inbound_nodes": [[["activation_17", 0, 0, {}]]], "name": "conv2d_18", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_18", "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "data_format": "channels_first", "activation": "linear", "strides": [1, 1]}}, {"inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "name": "activation_18", "class_name": "Activation", "config": {"trainable": true, "name": "activation_18", "activation": "relu"}}, {"inbound_nodes": [[["activation_18", 0, 0, {}]]], "name": "conv2d_19", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "filters": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_19", "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "kernel_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [1, 1], "data_format": "channels_first", "activation": "linear", "strides": [1, 1]}}, {"inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "name": "activation_19", "class_name": "Activation", "config": {"trainable": true, "name": "activation_19", "activation": "sigmoid"}}]}, "backend": "tensorflow"}