{"backend": "tensorflow", "config": {"layers": [{"name": "input_1", "config": {"batch_input_shape": [null, 1, 128, 128], "dtype": "float32", "name": "input_1", "sparse": false}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "conv2d_1", "config": {"padding": "same", "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "strides": [1, 1], "bias_regularizer": null, "filters": 16, "activity_regularizer": null, "activation": "linear", "use_bias": true, "data_format": "channels_first", "trainable": true, "name": "conv2d_1", "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "activation_1", "config": {"activation": "relu", "name": "activation_1", "trainable": true}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "Activation"}, {"name": "conv2d_2", "config": {"padding": "same", "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "strides": [1, 1], "bias_regularizer": null, "filters": 16, "activity_regularizer": null, "activation": "linear", "use_bias": true, "data_format": "channels_first", "trainable": true, "name": "conv2d_2", "bias_constraint": null}, "inbound_nodes": [[["activation_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "activation_2", "config": {"activation": "relu", "name": "activation_2", "trainable": true}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "Activation"}, {"name": "max_pooling2d_1", "config": {"padding": "valid", "strides": [2, 2], "data_format": "channels_first", "pool_size": [2, 2], "name": "max_pooling2d_1", "trainable": true}, "inbound_nodes": [[["activation_2", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "conv2d_3", "config": {"padding": "same", "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "strides": [1, 1], "bias_regularizer": null, "filters": 32, "activity_regularizer": null, "activation": "linear", "use_bias": true, "data_format": "channels_first", "trainable": true, "name": "conv2d_3", "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "activation_3", "config": {"activation": "relu", "name": "activation_3", "trainable": true}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "Activation"}, {"name": "conv2d_4", "config": {"padding": "same", "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "strides": [1, 1], "bias_regularizer": null, "filters": 32, "activity_regularizer": null, "activation": "linear", "use_bias": true, "data_format": "channels_first", "trainable": true, "name": "conv2d_4", "bias_constraint": null}, "inbound_nodes": [[["activation_3", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "activation_4", "config": {"activation": "relu", "name": "activation_4", "trainable": true}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "Activation"}, {"name": "max_pooling2d_2", "config": {"padding": "valid", "strides": [2, 2], "data_format": "channels_first", "pool_size": [2, 2], "name": "max_pooling2d_2", "trainable": true}, "inbound_nodes": [[["activation_4", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "conv2d_5", "config": {"padding": "same", "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "strides": [1, 1], "bias_regularizer": null, "filters": 64, "activity_regularizer": null, "activation": "linear", "use_bias": true, "data_format": "channels_first", "trainable": true, "name": "conv2d_5", "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "activation_5", "config": {"activation": "relu", "name": "activation_5", "trainable": true}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "Activation"}, {"name": "conv2d_6", "config": {"padding": "same", "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "strides": [1, 1], "bias_regularizer": null, "filters": 64, "activity_regularizer": null, "activation": "linear", "use_bias": true, "data_format": "channels_first", "trainable": true, "name": "conv2d_6", "bias_constraint": null}, "inbound_nodes": [[["activation_5", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "activation_6", "config": {"activation": "relu", "name": "activation_6", "trainable": true}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "class_name": "Activation"}, {"name": "max_pooling2d_3", "config": {"padding": "valid", "strides": [2, 2], "data_format": "channels_first", "pool_size": [2, 2], "name": "max_pooling2d_3", "trainable": true}, "inbound_nodes": [[["activation_6", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "conv2d_7", "config": {"padding": "same", "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "strides": [1, 1], "bias_regularizer": null, "filters": 128, "activity_regularizer": null, "activation": "linear", "use_bias": true, "data_format": "channels_first", "trainable": true, "name": "conv2d_7", "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "activation_7", "config": {"activation": "relu", "name": "activation_7", "trainable": true}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "class_name": "Activation"}, {"name": "conv2d_8", "config": {"padding": "same", "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "strides": [1, 1], "bias_regularizer": null, "filters": 128, "activity_regularizer": null, "activation": "linear", "use_bias": true, "data_format": "channels_first", "trainable": true, "name": "conv2d_8", "bias_constraint": null}, "inbound_nodes": [[["activation_7", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "activation_8", "config": {"activation": "relu", "name": "activation_8", "trainable": true}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "class_name": "Activation"}, {"name": "max_pooling2d_4", "config": {"padding": "valid", "strides": [2, 2], "data_format": "channels_first", "pool_size": [2, 2], "name": "max_pooling2d_4", "trainable": true}, "inbound_nodes": [[["activation_8", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "conv2d_9", "config": {"padding": "same", "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "strides": [1, 1], "bias_regularizer": null, "filters": 256, "activity_regularizer": null, "activation": "linear", "use_bias": true, "data_format": "channels_first", "trainable": true, "name": "conv2d_9", "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "activation_9", "config": {"activation": "relu", "name": "activation_9", "trainable": true}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "class_name": "Activation"}, {"name": "conv2d_10", "config": {"padding": "same", "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "strides": [1, 1], "bias_regularizer": null, "filters": 256, "activity_regularizer": null, "activation": "linear", "use_bias": true, "data_format": "channels_first", "trainable": true, "name": "conv2d_10", "bias_constraint": null}, "inbound_nodes": [[["activation_9", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "activation_10", "config": {"activation": "relu", "name": "activation_10", "trainable": true}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "class_name": "Activation"}, {"name": "up_sampling2d_1", "config": {"data_format": "channels_first", "size": [2, 2], "name": "up_sampling2d_1", "trainable": true}, "inbound_nodes": [[["activation_10", 0, 0, {}]]], "class_name": "UpSampling2D"}, {"name": "concatenate_1", "config": {"name": "concatenate_1", "trainable": true, "axis": 1}, "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}], ["activation_8", 0, 0, {}]]], "class_name": "Concatenate"}, {"name": "conv2d_11", "config": {"padding": "same", "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "strides": [1, 1], "bias_regularizer": null, "filters": 128, "activity_regularizer": null, "activation": "linear", "use_bias": true, "data_format": "channels_first", "trainable": true, "name": "conv2d_11", "bias_constraint": null}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "activation_11", "config": {"activation": "relu", "name": "activation_11", "trainable": true}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "class_name": "Activation"}, {"name": "conv2d_12", "config": {"padding": "same", "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "strides": [1, 1], "bias_regularizer": null, "filters": 128, "activity_regularizer": null, "activation": "linear", "use_bias": true, "data_format": "channels_first", "trainable": true, "name": "conv2d_12", "bias_constraint": null}, "inbound_nodes": [[["activation_11", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "activation_12", "config": {"activation": "relu", "name": "activation_12", "trainable": true}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "class_name": "Activation"}, {"name": "up_sampling2d_2", "config": {"data_format": "channels_first", "size": [2, 2], "name": "up_sampling2d_2", "trainable": true}, "inbound_nodes": [[["activation_12", 0, 0, {}]]], "class_name": "UpSampling2D"}, {"name": "concatenate_2", "config": {"name": "concatenate_2", "trainable": true, "axis": 1}, "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}], ["activation_6", 0, 0, {}]]], "class_name": "Concatenate"}, {"name": "conv2d_13", "config": {"padding": "same", "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "strides": [1, 1], "bias_regularizer": null, "filters": 64, "activity_regularizer": null, "activation": "linear", "use_bias": true, "data_format": "channels_first", "trainable": true, "name": "conv2d_13", "bias_constraint": null}, "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "activation_13", "config": {"activation": "relu", "name": "activation_13", "trainable": true}, "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "class_name": "Activation"}, {"name": "conv2d_14", "config": {"padding": "same", "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "strides": [1, 1], "bias_regularizer": null, "filters": 64, "activity_regularizer": null, "activation": "linear", "use_bias": true, "data_format": "channels_first", "trainable": true, "name": "conv2d_14", "bias_constraint": null}, "inbound_nodes": [[["activation_13", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "activation_14", "config": {"activation": "relu", "name": "activation_14", "trainable": true}, "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "class_name": "Activation"}, {"name": "up_sampling2d_3", "config": {"data_format": "channels_first", "size": [2, 2], "name": "up_sampling2d_3", "trainable": true}, "inbound_nodes": [[["activation_14", 0, 0, {}]]], "class_name": "UpSampling2D"}, {"name": "concatenate_3", "config": {"name": "concatenate_3", "trainable": true, "axis": 1}, "inbound_nodes": [[["up_sampling2d_3", 0, 0, {}], ["activation_4", 0, 0, {}]]], "class_name": "Concatenate"}, {"name": "conv2d_15", "config": {"padding": "same", "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "strides": [1, 1], "bias_regularizer": null, "filters": 32, "activity_regularizer": null, "activation": "linear", "use_bias": true, "data_format": "channels_first", "trainable": true, "name": "conv2d_15", "bias_constraint": null}, "inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "activation_15", "config": {"activation": "relu", "name": "activation_15", "trainable": true}, "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "class_name": "Activation"}, {"name": "conv2d_16", "config": {"padding": "same", "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "strides": [1, 1], "bias_regularizer": null, "filters": 32, "activity_regularizer": null, "activation": "linear", "use_bias": true, "data_format": "channels_first", "trainable": true, "name": "conv2d_16", "bias_constraint": null}, "inbound_nodes": [[["activation_15", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "activation_16", "config": {"activation": "relu", "name": "activation_16", "trainable": true}, "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "class_name": "Activation"}, {"name": "up_sampling2d_4", "config": {"data_format": "channels_first", "size": [2, 2], "name": "up_sampling2d_4", "trainable": true}, "inbound_nodes": [[["activation_16", 0, 0, {}]]], "class_name": "UpSampling2D"}, {"name": "concatenate_4", "config": {"name": "concatenate_4", "trainable": true, "axis": 1}, "inbound_nodes": [[["up_sampling2d_4", 0, 0, {}], ["activation_2", 0, 0, {}]]], "class_name": "Concatenate"}, {"name": "conv2d_17", "config": {"padding": "same", "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "strides": [1, 1], "bias_regularizer": null, "filters": 16, "activity_regularizer": null, "activation": "linear", "use_bias": true, "data_format": "channels_first", "trainable": true, "name": "conv2d_17", "bias_constraint": null}, "inbound_nodes": [[["concatenate_4", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "activation_17", "config": {"activation": "relu", "name": "activation_17", "trainable": true}, "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "class_name": "Activation"}, {"name": "conv2d_18", "config": {"padding": "same", "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "strides": [1, 1], "bias_regularizer": null, "filters": 16, "activity_regularizer": null, "activation": "linear", "use_bias": true, "data_format": "channels_first", "trainable": true, "name": "conv2d_18", "bias_constraint": null}, "inbound_nodes": [[["activation_17", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "activation_18", "config": {"activation": "relu", "name": "activation_18", "trainable": true}, "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "class_name": "Activation"}, {"name": "conv2d_19", "config": {"padding": "valid", "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [1, 1], "strides": [1, 1], "bias_regularizer": null, "filters": 2, "activity_regularizer": null, "activation": "linear", "use_bias": true, "data_format": "channels_first", "trainable": true, "name": "conv2d_19", "bias_constraint": null}, "inbound_nodes": [[["activation_18", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "activation_19", "config": {"activation": "sigmoid", "name": "activation_19", "trainable": true}, "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "class_name": "Activation"}], "input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["activation_19", 0, 0]]}, "keras_version": "2.0.9", "class_name": "Model"}