{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.0.9", "config": {"name": "model_1", "output_layers": [["activation_15", 0, 0]], "layers": [{"name": "input_1", "config": {"dtype": "float32", "batch_input_shape": [null, 2, 128, 128], "sparse": false, "name": "input_1"}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "conv2d_1", "config": {"kernel_regularizer": null, "trainable": true, "data_format": "channels_first", "name": "conv2d_1", "bias_constraint": null, "filters": 16, "use_bias": true, "strides": [1, 1], "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "activation_1", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "Activation"}, {"name": "conv2d_2", "config": {"kernel_regularizer": null, "trainable": true, "data_format": "channels_first", "name": "conv2d_2", "bias_constraint": null, "filters": 16, "use_bias": true, "strides": [1, 1], "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null}, "inbound_nodes": [[["activation_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "activation_2", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "Activation"}, {"name": "max_pooling2d_1", "config": {"trainable": true, "strides": [2, 2], "data_format": "channels_first", "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_1"}, "inbound_nodes": [[["activation_2", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "conv2d_3", "config": {"kernel_regularizer": null, "trainable": true, "data_format": "channels_first", "name": "conv2d_3", "bias_constraint": null, "filters": 32, "use_bias": true, "strides": [1, 1], "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "activation_3", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "Activation"}, {"name": "conv2d_4", "config": {"kernel_regularizer": null, "trainable": true, "data_format": "channels_first", "name": "conv2d_4", "bias_constraint": null, "filters": 32, "use_bias": true, "strides": [1, 1], "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null}, "inbound_nodes": [[["activation_3", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "activation_4", "config": {"trainable": true, "activation": "relu", "name": "activation_4"}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "Activation"}, {"name": "max_pooling2d_2", "config": {"trainable": true, "strides": [2, 2], "data_format": "channels_first", "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_2"}, "inbound_nodes": [[["activation_4", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "conv2d_5", "config": {"kernel_regularizer": null, "trainable": true, "data_format": "channels_first", "name": "conv2d_5", "bias_constraint": null, "filters": 64, "use_bias": true, "strides": [1, 1], "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "activation_5", "config": {"trainable": true, "activation": "relu", "name": "activation_5"}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "Activation"}, {"name": "conv2d_6", "config": {"kernel_regularizer": null, "trainable": true, "data_format": "channels_first", "name": "conv2d_6", "bias_constraint": null, "filters": 64, "use_bias": true, "strides": [1, 1], "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null}, "inbound_nodes": [[["activation_5", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "activation_6", "config": {"trainable": true, "activation": "relu", "name": "activation_6"}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "class_name": "Activation"}, {"name": "max_pooling2d_3", "config": {"trainable": true, "strides": [2, 2], "data_format": "channels_first", "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_3"}, "inbound_nodes": [[["activation_6", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "conv2d_7", "config": {"kernel_regularizer": null, "trainable": true, "data_format": "channels_first", "name": "conv2d_7", "bias_constraint": null, "filters": 128, "use_bias": true, "strides": [1, 1], "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null}, "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "activation_7", "config": {"trainable": true, "activation": "relu", "name": "activation_7"}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "class_name": "Activation"}, {"name": "conv2d_8", "config": {"kernel_regularizer": null, "trainable": true, "data_format": "channels_first", "name": "conv2d_8", "bias_constraint": null, "filters": 128, "use_bias": true, "strides": [1, 1], "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null}, "inbound_nodes": [[["activation_7", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "activation_8", "config": {"trainable": true, "activation": "relu", "name": "activation_8"}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "class_name": "Activation"}, {"name": "up_sampling2d_1", "config": {"trainable": true, "size": [2, 2], "data_format": "channels_first", "name": "up_sampling2d_1"}, "inbound_nodes": [[["activation_8", 0, 0, {}]]], "class_name": "UpSampling2D"}, {"name": "concatenate_1", "config": {"trainable": true, "axis": 1, "name": "concatenate_1"}, "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}], ["activation_6", 0, 0, {}]]], "class_name": "Concatenate"}, {"name": "conv2d_9", "config": {"kernel_regularizer": null, "trainable": true, "data_format": "channels_first", "name": "conv2d_9", "bias_constraint": null, "filters": 64, "use_bias": true, "strides": [1, 1], "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "activation_9", "config": {"trainable": true, "activation": "relu", "name": "activation_9"}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "class_name": "Activation"}, {"name": "conv2d_10", "config": {"kernel_regularizer": null, "trainable": true, "data_format": "channels_first", "name": "conv2d_10", "bias_constraint": null, "filters": 64, "use_bias": true, "strides": [1, 1], "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null}, "inbound_nodes": [[["activation_9", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "activation_10", "config": {"trainable": true, "activation": "relu", "name": "activation_10"}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "class_name": "Activation"}, {"name": "up_sampling2d_2", "config": {"trainable": true, "size": [2, 2], "data_format": "channels_first", "name": "up_sampling2d_2"}, "inbound_nodes": [[["activation_10", 0, 0, {}]]], "class_name": "UpSampling2D"}, {"name": "concatenate_2", "config": {"trainable": true, "axis": 1, "name": "concatenate_2"}, "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}], ["activation_4", 0, 0, {}]]], "class_name": "Concatenate"}, {"name": "conv2d_11", "config": {"kernel_regularizer": null, "trainable": true, "data_format": "channels_first", "name": "conv2d_11", "bias_constraint": null, "filters": 32, "use_bias": true, "strides": [1, 1], "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null}, "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "activation_11", "config": {"trainable": true, "activation": "relu", "name": "activation_11"}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "class_name": "Activation"}, {"name": "conv2d_12", "config": {"kernel_regularizer": null, "trainable": true, "data_format": "channels_first", "name": "conv2d_12", "bias_constraint": null, "filters": 32, "use_bias": true, "strides": [1, 1], "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null}, "inbound_nodes": [[["activation_11", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "activation_12", "config": {"trainable": true, "activation": "relu", "name": "activation_12"}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "class_name": "Activation"}, {"name": "up_sampling2d_3", "config": {"trainable": true, "size": [2, 2], "data_format": "channels_first", "name": "up_sampling2d_3"}, "inbound_nodes": [[["activation_12", 0, 0, {}]]], "class_name": "UpSampling2D"}, {"name": "concatenate_3", "config": {"trainable": true, "axis": 1, "name": "concatenate_3"}, "inbound_nodes": [[["up_sampling2d_3", 0, 0, {}], ["activation_2", 0, 0, {}]]], "class_name": "Concatenate"}, {"name": "conv2d_13", "config": {"kernel_regularizer": null, "trainable": true, "data_format": "channels_first", "name": "conv2d_13", "bias_constraint": null, "filters": 16, "use_bias": true, "strides": [1, 1], "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null}, "inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "activation_13", "config": {"trainable": true, "activation": "relu", "name": "activation_13"}, "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "class_name": "Activation"}, {"name": "conv2d_14", "config": {"kernel_regularizer": null, "trainable": true, "data_format": "channels_first", "name": "conv2d_14", "bias_constraint": null, "filters": 16, "use_bias": true, "strides": [1, 1], "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null}, "inbound_nodes": [[["activation_13", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "activation_14", "config": {"trainable": true, "activation": "relu", "name": "activation_14"}, "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "class_name": "Activation"}, {"name": "conv2d_15", "config": {"kernel_regularizer": null, "trainable": true, "data_format": "channels_first", "name": "conv2d_15", "bias_constraint": null, "filters": 1, "use_bias": true, "strides": [1, 1], "padding": "valid", "activity_regularizer": null, "kernel_size": [1, 1], "activation": "linear", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null}, "inbound_nodes": [[["activation_14", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "activation_15", "config": {"trainable": true, "activation": "sigmoid", "name": "activation_15"}, "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "class_name": "Activation"}], "input_layers": [["input_1", 0, 0]]}}