{"keras_version": "2.0.9", "config": {"input_layers": [["input_1", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "name": "input_1", "batch_input_shape": [null, 2, 128, 128]}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Conv2D", "config": {"padding": "same", "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "activation": "linear", "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "strides": [1, 1], "filters": 16, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "name": "conv2d_1"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "activation_1"}, {"class_name": "Conv2D", "config": {"padding": "same", "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "activation": "linear", "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "strides": [1, 1], "filters": 16, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "name": "conv2d_2"}, "inbound_nodes": [[["activation_1", 0, 0, {}]]], "name": "conv2d_2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "activation_2"}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_first", "name": "max_pooling2d_1", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "inbound_nodes": [[["activation_2", 0, 0, {}]]], "name": "max_pooling2d_1"}, {"class_name": "Conv2D", "config": {"padding": "same", "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "activation": "linear", "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "strides": [1, 1], "filters": 32, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "name": "conv2d_3"}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "conv2d_3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "activation_3"}, {"class_name": "Conv2D", "config": {"padding": "same", "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "activation": "linear", "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "strides": [1, 1], "filters": 32, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "name": "conv2d_4"}, "inbound_nodes": [[["activation_3", 0, 0, {}]]], "name": "conv2d_4"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "activation_4"}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_first", "name": "max_pooling2d_2", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "max_pooling2d_2"}, {"class_name": "Conv2D", "config": {"padding": "same", "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "activation": "linear", "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "strides": [1, 1], "filters": 64, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "name": "conv2d_5"}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "conv2d_5"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "activation_5"}, {"class_name": "Conv2D", "config": {"padding": "same", "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "activation": "linear", "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "strides": [1, 1], "filters": 64, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "name": "conv2d_6"}, "inbound_nodes": [[["activation_5", 0, 0, {}]]], "name": "conv2d_6"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_6"}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "activation_6"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "data_format": "channels_first", "size": [2, 2], "name": "up_sampling2d_1"}, "inbound_nodes": [[["activation_6", 0, 0, {}]]], "name": "up_sampling2d_1"}, {"class_name": "Concatenate", "config": {"axis": 1, "trainable": true, "name": "concatenate_1"}, "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}], ["activation_4", 0, 0, {}]]], "name": "concatenate_1"}, {"class_name": "Conv2D", "config": {"padding": "same", "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "activation": "linear", "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "strides": [1, 1], "filters": 32, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "name": "conv2d_7"}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "name": "conv2d_7"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_7"}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "name": "activation_7"}, {"class_name": "Conv2D", "config": {"padding": "same", "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "activation": "linear", "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "strides": [1, 1], "filters": 32, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "name": "conv2d_8"}, "inbound_nodes": [[["activation_7", 0, 0, {}]]], "name": "conv2d_8"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_8"}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "name": "activation_8"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "data_format": "channels_first", "size": [2, 2], "name": "up_sampling2d_2"}, "inbound_nodes": [[["activation_8", 0, 0, {}]]], "name": "up_sampling2d_2"}, {"class_name": "Concatenate", "config": {"axis": 1, "trainable": true, "name": "concatenate_2"}, "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}], ["activation_2", 0, 0, {}]]], "name": "concatenate_2"}, {"class_name": "Conv2D", "config": {"padding": "same", "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "activation": "linear", "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "strides": [1, 1], "filters": 16, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "name": "conv2d_9"}, "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "name": "conv2d_9"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_9"}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "name": "activation_9"}, {"class_name": "Conv2D", "config": {"padding": "same", "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "activation": "linear", "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "strides": [1, 1], "filters": 16, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "name": "conv2d_10"}, "inbound_nodes": [[["activation_9", 0, 0, {}]]], "name": "conv2d_10"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_10"}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "name": "activation_10"}, {"class_name": "Conv2D", "config": {"padding": "valid", "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "activation": "linear", "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [1, 1], "trainable": true, "strides": [1, 1], "filters": 1, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "name": "conv2d_11"}, "inbound_nodes": [[["activation_10", 0, 0, {}]]], "name": "conv2d_11"}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "activation_11"}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "name": "activation_11"}], "output_layers": [["activation_11", 0, 0]], "name": "model_1"}, "class_name": "Model", "backend": "tensorflow"}