{"backend": "tensorflow", "config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["activation_11", 0, 0]], "name": "model_1", "layers": [{"config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, 2, 128, 128], "name": "input_1"}, "inbound_nodes": [], "class_name": "InputLayer", "name": "input_1"}, {"config": {"filters": 16, "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "padding": "same", "name": "conv2d_1", "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "data_format": "channels_first"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_1"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "Activation", "name": "activation_1"}, {"config": {"filters": 16, "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "padding": "same", "name": "conv2d_2", "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "data_format": "channels_first"}, "inbound_nodes": [[["activation_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_2"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "Activation", "name": "activation_2"}, {"config": {"padding": "valid", "trainable": true, "name": "max_pooling2d_1", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_first"}, "inbound_nodes": [[["activation_2", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_1"}, {"config": {"filters": 32, "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "padding": "same", "name": "conv2d_3", "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "data_format": "channels_first"}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_3"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "Activation", "name": "activation_3"}, {"config": {"filters": 32, "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "padding": "same", "name": "conv2d_4", "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "data_format": "channels_first"}, "inbound_nodes": [[["activation_3", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_4"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "Activation", "name": "activation_4"}, {"config": {"padding": "valid", "trainable": true, "name": "max_pooling2d_2", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_first"}, "inbound_nodes": [[["activation_4", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_2"}, {"config": {"filters": 64, "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "padding": "same", "name": "conv2d_5", "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "data_format": "channels_first"}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_5"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_5"}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "Activation", "name": "activation_5"}, {"config": {"filters": 64, "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "padding": "same", "name": "conv2d_6", "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "data_format": "channels_first"}, "inbound_nodes": [[["activation_5", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_6"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_6"}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "class_name": "Activation", "name": "activation_6"}, {"config": {"size": [2, 2], "name": "up_sampling2d_1", "trainable": true, "data_format": "channels_first"}, "inbound_nodes": [[["activation_6", 0, 0, {}]]], "class_name": "UpSampling2D", "name": "up_sampling2d_1"}, {"config": {"axis": 1, "trainable": true, "name": "concatenate_1"}, "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}], ["activation_4", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_1"}, {"config": {"filters": 32, "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "padding": "same", "name": "conv2d_7", "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "data_format": "channels_first"}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_7"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_7"}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "class_name": "Activation", "name": "activation_7"}, {"config": {"filters": 32, "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "padding": "same", "name": "conv2d_8", "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "data_format": "channels_first"}, "inbound_nodes": [[["activation_7", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_8"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_8"}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "class_name": "Activation", "name": "activation_8"}, {"config": {"size": [2, 2], "name": "up_sampling2d_2", "trainable": true, "data_format": "channels_first"}, "inbound_nodes": [[["activation_8", 0, 0, {}]]], "class_name": "UpSampling2D", "name": "up_sampling2d_2"}, {"config": {"axis": 1, "trainable": true, "name": "concatenate_2"}, "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}], ["activation_2", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_2"}, {"config": {"filters": 16, "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "padding": "same", "name": "conv2d_9", "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "data_format": "channels_first"}, "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_9"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_9"}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "class_name": "Activation", "name": "activation_9"}, {"config": {"filters": 16, "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "padding": "same", "name": "conv2d_10", "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "data_format": "channels_first"}, "inbound_nodes": [[["activation_9", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_10"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_10"}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "class_name": "Activation", "name": "activation_10"}, {"config": {"filters": 1, "kernel_size": [1, 1], "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "padding": "valid", "name": "conv2d_11", "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "data_format": "channels_first"}, "inbound_nodes": [[["activation_10", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_11"}, {"config": {"activation": "sigmoid", "trainable": true, "name": "activation_11"}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "class_name": "Activation", "name": "activation_11"}]}, "keras_version": "2.0.9", "class_name": "Model"}