{"config": {"output_layers": [["activation_11", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0]], "layers": [{"config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 2, 128, 128], "name": "input_1"}, "class_name": "InputLayer", "name": "input_1", "inbound_nodes": []}, {"config": {"filters": 16, "kernel_size": [3, 3], "use_bias": true, "name": "conv2d_1", "strides": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_first", "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "padding": "same", "activity_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation", "name": "activation_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"config": {"filters": 16, "kernel_size": [3, 3], "use_bias": true, "name": "conv2d_2", "strides": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_first", "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "padding": "same", "activity_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_2", "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "class_name": "Activation", "name": "activation_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"config": {"name": "max_pooling2d_1", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "data_format": "channels_first"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_1", "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"config": {"filters": 32, "kernel_size": [3, 3], "use_bias": true, "name": "conv2d_3", "strides": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_first", "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "padding": "same", "activity_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_3", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"config": {"trainable": true, "activation": "relu", "name": "activation_3"}, "class_name": "Activation", "name": "activation_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"config": {"filters": 32, "kernel_size": [3, 3], "use_bias": true, "name": "conv2d_4", "strides": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_first", "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "padding": "same", "activity_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_4", "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"config": {"trainable": true, "activation": "relu", "name": "activation_4"}, "class_name": "Activation", "name": "activation_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"config": {"name": "max_pooling2d_2", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "data_format": "channels_first"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_2", "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"config": {"filters": 64, "kernel_size": [3, 3], "use_bias": true, "name": "conv2d_5", "strides": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_first", "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "padding": "same", "activity_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_5", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"config": {"trainable": true, "activation": "relu", "name": "activation_5"}, "class_name": "Activation", "name": "activation_5", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"config": {"filters": 64, "kernel_size": [3, 3], "use_bias": true, "name": "conv2d_6", "strides": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_first", "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "padding": "same", "activity_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_6", "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"config": {"trainable": true, "activation": "relu", "name": "activation_6"}, "class_name": "Activation", "name": "activation_6", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"config": {"trainable": true, "size": [2, 2], "data_format": "channels_first", "name": "up_sampling2d_1"}, "class_name": "UpSampling2D", "name": "up_sampling2d_1", "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"config": {"trainable": true, "axis": 1, "name": "concatenate_1"}, "class_name": "Concatenate", "name": "concatenate_1", "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}], ["activation_4", 0, 0, {}]]]}, {"config": {"filters": 32, "kernel_size": [3, 3], "use_bias": true, "name": "conv2d_7", "strides": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_first", "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "padding": "same", "activity_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_7", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"config": {"trainable": true, "activation": "relu", "name": "activation_7"}, "class_name": "Activation", "name": "activation_7", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"config": {"filters": 32, "kernel_size": [3, 3], "use_bias": true, "name": "conv2d_8", "strides": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_first", "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "padding": "same", "activity_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_8", "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"config": {"trainable": true, "activation": "relu", "name": "activation_8"}, "class_name": "Activation", "name": "activation_8", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"config": {"trainable": true, "size": [2, 2], "data_format": "channels_first", "name": "up_sampling2d_2"}, "class_name": "UpSampling2D", "name": "up_sampling2d_2", "inbound_nodes": [[["activation_8", 0, 0, {}]]]}, {"config": {"trainable": true, "axis": 1, "name": "concatenate_2"}, "class_name": "Concatenate", "name": "concatenate_2", "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}], ["activation_2", 0, 0, {}]]]}, {"config": {"filters": 16, "kernel_size": [3, 3], "use_bias": true, "name": "conv2d_9", "strides": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_first", "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "padding": "same", "activity_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_9", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"config": {"trainable": true, "activation": "relu", "name": "activation_9"}, "class_name": "Activation", "name": "activation_9", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"config": {"filters": 16, "kernel_size": [3, 3], "use_bias": true, "name": "conv2d_10", "strides": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_first", "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "padding": "same", "activity_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_10", "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"config": {"trainable": true, "activation": "relu", "name": "activation_10"}, "class_name": "Activation", "name": "activation_10", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"config": {"filters": 1, "kernel_size": [1, 1], "use_bias": true, "name": "conv2d_11", "strides": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_first", "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "padding": "valid", "activity_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_11", "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"config": {"trainable": true, "activation": "sigmoid", "name": "activation_11"}, "class_name": "Activation", "name": "activation_11", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}]}, "backend": "tensorflow", "class_name": "Model", "keras_version": "2.0.9"}