{"class_name": "Model", "config": {"name": "model_1", "input_layers": [["input_1", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"sparse": false, "dtype": "float32", "name": "input_1", "batch_input_shape": [null, 2, 128, 128]}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"data_format": "channels_first", "use_bias": true, "kernel_regularizer": null, "trainable": true, "name": "conv2d_1", "filters": 16, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "dilation_rate": [1, 1]}, "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}, "name": "activation_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"data_format": "channels_first", "use_bias": true, "kernel_regularizer": null, "trainable": true, "name": "conv2d_2", "filters": 16, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "dilation_rate": [1, 1]}, "name": "conv2d_2", "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}, "name": "activation_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_first", "trainable": true, "name": "max_pooling2d_1", "strides": [2, 2], "pool_size": [2, 2]}, "name": "max_pooling2d_1", "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"data_format": "channels_first", "use_bias": true, "kernel_regularizer": null, "trainable": true, "name": "conv2d_3", "filters": 32, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "dilation_rate": [1, 1]}, "name": "conv2d_3", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_3", "trainable": true}, "name": "activation_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"data_format": "channels_first", "use_bias": true, "kernel_regularizer": null, "trainable": true, "name": "conv2d_4", "filters": 32, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "dilation_rate": [1, 1]}, "name": "conv2d_4", "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_4", "trainable": true}, "name": "activation_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_first", "trainable": true, "name": "max_pooling2d_2", "strides": [2, 2], "pool_size": [2, 2]}, "name": "max_pooling2d_2", "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"data_format": "channels_first", "use_bias": true, "kernel_regularizer": null, "trainable": true, "name": "conv2d_5", "filters": 64, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "dilation_rate": [1, 1]}, "name": "conv2d_5", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_5", "trainable": true}, "name": "activation_5", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"data_format": "channels_first", "use_bias": true, "kernel_regularizer": null, "trainable": true, "name": "conv2d_6", "filters": 64, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "dilation_rate": [1, 1]}, "name": "conv2d_6", "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_6", "trainable": true}, "name": "activation_6", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"size": [2, 2], "data_format": "channels_first", "name": "up_sampling2d_1", "trainable": true}, "name": "up_sampling2d_1", "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"axis": 1, "name": "concatenate_1", "trainable": true}, "name": "concatenate_1", "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}], ["activation_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"data_format": "channels_first", "use_bias": true, "kernel_regularizer": null, "trainable": true, "name": "conv2d_7", "filters": 32, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "dilation_rate": [1, 1]}, "name": "conv2d_7", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_7", "trainable": true}, "name": "activation_7", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"data_format": "channels_first", "use_bias": true, "kernel_regularizer": null, "trainable": true, "name": "conv2d_8", "filters": 32, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "dilation_rate": [1, 1]}, "name": "conv2d_8", "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_8", "trainable": true}, "name": "activation_8", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"size": [2, 2], "data_format": "channels_first", "name": "up_sampling2d_2", "trainable": true}, "name": "up_sampling2d_2", "inbound_nodes": [[["activation_8", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"axis": 1, "name": "concatenate_2", "trainable": true}, "name": "concatenate_2", "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}], ["activation_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"data_format": "channels_first", "use_bias": true, "kernel_regularizer": null, "trainable": true, "name": "conv2d_9", "filters": 16, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "dilation_rate": [1, 1]}, "name": "conv2d_9", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_9", "trainable": true}, "name": "activation_9", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"data_format": "channels_first", "use_bias": true, "kernel_regularizer": null, "trainable": true, "name": "conv2d_10", "filters": 16, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "dilation_rate": [1, 1]}, "name": "conv2d_10", "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_10", "trainable": true}, "name": "activation_10", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"data_format": "channels_first", "use_bias": true, "kernel_regularizer": null, "trainable": true, "name": "conv2d_11", "filters": 1, "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "padding": "valid", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "dilation_rate": [1, 1]}, "name": "conv2d_11", "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "sigmoid", "name": "activation_11", "trainable": true}, "name": "activation_11", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}], "output_layers": [["activation_11", 0, 0]]}, "backend": "tensorflow", "keras_version": "2.0.9"}