{"class_name": "Model", "config": {"name": "model_15", "layers": [{"name": "input_8", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 128, 128, 1], "dtype": "float32", "sparse": false, "name": "input_8"}, "inbound_nodes": []}, {"name": "conv2d_162", "class_name": "Conv2D", "config": {"name": "conv2d_162", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_8", 0, 0, {}]]]}, {"name": "activation_134", "class_name": "Activation", "config": {"name": "activation_134", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_162", 0, 0, {}]]]}, {"name": "conv2d_163", "class_name": "Conv2D", "config": {"name": "conv2d_163", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_134", 0, 0, {}]]]}, {"name": "activation_135", "class_name": "Activation", "config": {"name": "activation_135", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_163", 0, 0, {}]]]}, {"name": "max_pooling2d_29", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_29", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_135", 0, 0, {}]]]}, {"name": "conv2d_164", "class_name": "Conv2D", "config": {"name": "conv2d_164", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_29", 0, 0, {}]]]}, {"name": "activation_136", "class_name": "Activation", "config": {"name": "activation_136", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_164", 0, 0, {}]]]}, {"name": "conv2d_165", "class_name": "Conv2D", "config": {"name": "conv2d_165", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_136", 0, 0, {}]]]}, {"name": "activation_137", "class_name": "Activation", "config": {"name": "activation_137", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_165", 0, 0, {}]]]}, {"name": "max_pooling2d_30", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_30", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_137", 0, 0, {}]]]}, {"name": "conv2d_166", "class_name": "Conv2D", "config": {"name": "conv2d_166", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_30", 0, 0, {}]]]}, {"name": "activation_138", "class_name": "Activation", "config": {"name": "activation_138", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_166", 0, 0, {}]]]}, {"name": "conv2d_167", "class_name": "Conv2D", "config": {"name": "conv2d_167", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_138", 0, 0, {}]]]}, {"name": "activation_139", "class_name": "Activation", "config": {"name": "activation_139", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_167", 0, 0, {}]]]}, {"name": "max_pooling2d_31", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_31", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_139", 0, 0, {}]]]}, {"name": "conv2d_168", "class_name": "Conv2D", "config": {"name": "conv2d_168", "trainable": true, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_31", 0, 0, {}]]]}, {"name": "activation_140", "class_name": "Activation", "config": {"name": "activation_140", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_168", 0, 0, {}]]]}, {"name": "conv2d_169", "class_name": "Conv2D", "config": {"name": "conv2d_169", "trainable": true, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_140", 0, 0, {}]]]}, {"name": "activation_141", "class_name": "Activation", "config": {"name": "activation_141", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_169", 0, 0, {}]]]}, {"name": "max_pooling2d_32", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_32", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_141", 0, 0, {}]]]}, {"name": "conv2d_170", "class_name": "Conv2D", "config": {"name": "conv2d_170", "trainable": true, "filters": 1024, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_32", 0, 0, {}]]]}, {"name": "activation_142", "class_name": "Activation", "config": {"name": "activation_142", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_170", 0, 0, {}]]]}, {"name": "conv2d_171", "class_name": "Conv2D", "config": {"name": "conv2d_171", "trainable": true, "filters": 1024, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_142", 0, 0, {}]]]}, {"name": "activation_143", "class_name": "Activation", "config": {"name": "activation_143", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_171", 0, 0, {}]]]}, {"name": "up_sampling2d_29", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_29", "trainable": true, "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["activation_143", 0, 0, {}]]]}, {"name": "conv2d_172", "class_name": "Conv2D", "config": {"name": "conv2d_172", "trainable": true, "filters": 1024, "kernel_size": [2, 2], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_29", 0, 0, {}]]]}, {"name": "concatenate_29", "class_name": "Concatenate", "config": {"name": "concatenate_29", "trainable": true, "axis": -1}, "inbound_nodes": [[["conv2d_172", 0, 0, {}], ["activation_141", 0, 0, {}]]]}, {"name": "conv2d_173", "class_name": "Conv2D", "config": {"name": "conv2d_173", "trainable": true, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_29", 0, 0, {}]]]}, {"name": "activation_144", "class_name": "Activation", "config": {"name": "activation_144", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_173", 0, 0, {}]]]}, {"name": "conv2d_174", "class_name": "Conv2D", "config": {"name": "conv2d_174", "trainable": true, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_144", 0, 0, {}]]]}, {"name": "activation_145", "class_name": "Activation", "config": {"name": "activation_145", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_174", 0, 0, {}]]]}, {"name": "up_sampling2d_30", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_30", "trainable": true, "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["activation_145", 0, 0, {}]]]}, {"name": "conv2d_175", "class_name": "Conv2D", "config": {"name": "conv2d_175", "trainable": true, "filters": 512, "kernel_size": [2, 2], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_30", 0, 0, {}]]]}, {"name": "concatenate_30", "class_name": "Concatenate", "config": {"name": "concatenate_30", "trainable": true, "axis": -1}, "inbound_nodes": [[["conv2d_175", 0, 0, {}], ["activation_139", 0, 0, {}]]]}, {"name": "conv2d_176", "class_name": "Conv2D", "config": {"name": "conv2d_176", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_30", 0, 0, {}]]]}, {"name": "activation_146", "class_name": "Activation", "config": {"name": "activation_146", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_176", 0, 0, {}]]]}, {"name": "conv2d_177", "class_name": "Conv2D", "config": {"name": "conv2d_177", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_146", 0, 0, {}]]]}, {"name": "activation_147", "class_name": "Activation", "config": {"name": "activation_147", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_177", 0, 0, {}]]]}, {"name": "up_sampling2d_31", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_31", "trainable": true, "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["activation_147", 0, 0, {}]]]}, {"name": "conv2d_178", "class_name": "Conv2D", "config": {"name": "conv2d_178", "trainable": true, "filters": 256, "kernel_size": [2, 2], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_31", 0, 0, {}]]]}, {"name": "concatenate_31", "class_name": "Concatenate", "config": {"name": "concatenate_31", "trainable": true, "axis": -1}, "inbound_nodes": [[["conv2d_178", 0, 0, {}], ["activation_137", 0, 0, {}]]]}, {"name": "conv2d_179", "class_name": "Conv2D", "config": {"name": "conv2d_179", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_31", 0, 0, {}]]]}, {"name": "activation_148", "class_name": "Activation", "config": {"name": "activation_148", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_179", 0, 0, {}]]]}, {"name": "conv2d_180", "class_name": "Conv2D", "config": {"name": "conv2d_180", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_148", 0, 0, {}]]]}, {"name": "activation_149", "class_name": "Activation", "config": {"name": "activation_149", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_180", 0, 0, {}]]]}, {"name": "up_sampling2d_32", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_32", "trainable": true, "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["activation_149", 0, 0, {}]]]}, {"name": "conv2d_181", "class_name": "Conv2D", "config": {"name": "conv2d_181", "trainable": true, "filters": 128, "kernel_size": [2, 2], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_32", 0, 0, {}]]]}, {"name": "concatenate_32", "class_name": "Concatenate", "config": {"name": "concatenate_32", "trainable": true, "axis": -1}, "inbound_nodes": [[["conv2d_181", 0, 0, {}], ["activation_135", 0, 0, {}]]]}, {"name": "conv2d_182", "class_name": "Conv2D", "config": {"name": "conv2d_182", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_32", 0, 0, {}]]]}, {"name": "activation_150", "class_name": "Activation", "config": {"name": "activation_150", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_182", 0, 0, {}]]]}, {"name": "conv2d_183", "class_name": "Conv2D", "config": {"name": "conv2d_183", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_150", 0, 0, {}]]]}, {"name": "activation_151", "class_name": "Activation", "config": {"name": "activation_151", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_183", 0, 0, {}]]]}, {"name": "conv2d_184", "class_name": "Conv2D", "config": {"name": "conv2d_184", "trainable": true, "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_151", 0, 0, {}]]]}, {"name": "activation_152", "class_name": "Activation", "config": {"name": "activation_152", "trainable": true, "activation": "sigmoid"}, "inbound_nodes": [[["conv2d_184", 0, 0, {}]]]}], "input_layers": [["input_8", 0, 0]], "output_layers": [["activation_152", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}