{"class_name": "Model", "config": {"name": "model_27", "layers": [{"name": "input_14", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 1], "dtype": "float32", "sparse": false, "name": "input_14"}, "inbound_nodes": []}, {"name": "conv2d_248", "class_name": "Conv2D", "config": {"name": "conv2d_248", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_14", 0, 0, {}]]]}, {"name": "activation_248", "class_name": "Activation", "config": {"name": "activation_248", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_248", 0, 0, {}]]]}, {"name": "conv2d_249", "class_name": "Conv2D", "config": {"name": "conv2d_249", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_248", 0, 0, {}]]]}, {"name": "activation_249", "class_name": "Activation", "config": {"name": "activation_249", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_249", 0, 0, {}]]]}, {"name": "max_pooling2d_53", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_53", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_249", 0, 0, {}]]]}, {"name": "conv2d_250", "class_name": "Conv2D", "config": {"name": "conv2d_250", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_53", 0, 0, {}]]]}, {"name": "activation_250", "class_name": "Activation", "config": {"name": "activation_250", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_250", 0, 0, {}]]]}, {"name": "conv2d_251", "class_name": "Conv2D", "config": {"name": "conv2d_251", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_250", 0, 0, {}]]]}, {"name": "activation_251", "class_name": "Activation", "config": {"name": "activation_251", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_251", 0, 0, {}]]]}, {"name": "max_pooling2d_54", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_54", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_251", 0, 0, {}]]]}, {"name": "conv2d_252", "class_name": "Conv2D", "config": {"name": "conv2d_252", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_54", 0, 0, {}]]]}, {"name": "activation_252", "class_name": "Activation", "config": {"name": "activation_252", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_252", 0, 0, {}]]]}, {"name": "conv2d_253", "class_name": "Conv2D", "config": {"name": "conv2d_253", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_252", 0, 0, {}]]]}, {"name": "activation_253", "class_name": "Activation", "config": {"name": "activation_253", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_253", 0, 0, {}]]]}, {"name": "max_pooling2d_55", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_55", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_253", 0, 0, {}]]]}, {"name": "conv2d_254", "class_name": "Conv2D", "config": {"name": "conv2d_254", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_55", 0, 0, {}]]]}, {"name": "activation_254", "class_name": "Activation", "config": {"name": "activation_254", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_254", 0, 0, {}]]]}, {"name": "conv2d_255", "class_name": "Conv2D", "config": {"name": "conv2d_255", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_254", 0, 0, {}]]]}, {"name": "activation_255", "class_name": "Activation", "config": {"name": "activation_255", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_255", 0, 0, {}]]]}, {"name": "max_pooling2d_56", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_56", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_255", 0, 0, {}]]]}, {"name": "conv2d_256", "class_name": "Conv2D", "config": {"name": "conv2d_256", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_56", 0, 0, {}]]]}, {"name": "activation_256", "class_name": "Activation", "config": {"name": "activation_256", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_256", 0, 0, {}]]]}, {"name": "conv2d_257", "class_name": "Conv2D", "config": {"name": "conv2d_257", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_256", 0, 0, {}]]]}, {"name": "activation_257", "class_name": "Activation", "config": {"name": "activation_257", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_257", 0, 0, {}]]]}, {"name": "up_sampling2d_53", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_53", "trainable": true, "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["activation_257", 0, 0, {}]]]}, {"name": "concatenate_53", "class_name": "Concatenate", "config": {"name": "concatenate_53", "trainable": true, "axis": -1}, "inbound_nodes": [[["up_sampling2d_53", 0, 0, {}], ["activation_255", 0, 0, {}]]]}, {"name": "conv2d_258", "class_name": "Conv2D", "config": {"name": "conv2d_258", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_53", 0, 0, {}]]]}, {"name": "activation_258", "class_name": "Activation", "config": {"name": "activation_258", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_258", 0, 0, {}]]]}, {"name": "conv2d_259", "class_name": "Conv2D", "config": {"name": "conv2d_259", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_258", 0, 0, {}]]]}, {"name": "activation_259", "class_name": "Activation", "config": {"name": "activation_259", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_259", 0, 0, {}]]]}, {"name": "up_sampling2d_54", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_54", "trainable": true, "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["activation_259", 0, 0, {}]]]}, {"name": "concatenate_54", "class_name": "Concatenate", "config": {"name": "concatenate_54", "trainable": true, "axis": -1}, "inbound_nodes": [[["up_sampling2d_54", 0, 0, {}], ["activation_253", 0, 0, {}]]]}, {"name": "conv2d_260", "class_name": "Conv2D", "config": {"name": "conv2d_260", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_54", 0, 0, {}]]]}, {"name": "activation_260", "class_name": "Activation", "config": {"name": "activation_260", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_260", 0, 0, {}]]]}, {"name": "conv2d_261", "class_name": "Conv2D", "config": {"name": "conv2d_261", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_260", 0, 0, {}]]]}, {"name": "activation_261", "class_name": "Activation", "config": {"name": "activation_261", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_261", 0, 0, {}]]]}, {"name": "up_sampling2d_55", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_55", "trainable": true, "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["activation_261", 0, 0, {}]]]}, {"name": "concatenate_55", "class_name": "Concatenate", "config": {"name": "concatenate_55", "trainable": true, "axis": -1}, "inbound_nodes": [[["up_sampling2d_55", 0, 0, {}], ["activation_251", 0, 0, {}]]]}, {"name": "conv2d_262", "class_name": "Conv2D", "config": {"name": "conv2d_262", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_55", 0, 0, {}]]]}, {"name": "activation_262", "class_name": "Activation", "config": {"name": "activation_262", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_262", 0, 0, {}]]]}, {"name": "conv2d_263", "class_name": "Conv2D", "config": {"name": "conv2d_263", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_262", 0, 0, {}]]]}, {"name": "activation_263", "class_name": "Activation", "config": {"name": "activation_263", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_263", 0, 0, {}]]]}, {"name": "up_sampling2d_56", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_56", "trainable": true, "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["activation_263", 0, 0, {}]]]}, {"name": "concatenate_56", "class_name": "Concatenate", "config": {"name": "concatenate_56", "trainable": true, "axis": -1}, "inbound_nodes": [[["up_sampling2d_56", 0, 0, {}], ["activation_249", 0, 0, {}]]]}, {"name": "conv2d_264", "class_name": "Conv2D", "config": {"name": "conv2d_264", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_56", 0, 0, {}]]]}, {"name": "activation_264", "class_name": "Activation", "config": {"name": "activation_264", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_264", 0, 0, {}]]]}, {"name": "conv2d_265", "class_name": "Conv2D", "config": {"name": "conv2d_265", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_264", 0, 0, {}]]]}, {"name": "activation_265", "class_name": "Activation", "config": {"name": "activation_265", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_265", 0, 0, {}]]]}, {"name": "conv2d_266", "class_name": "Conv2D", "config": {"name": "conv2d_266", "trainable": true, "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_265", 0, 0, {}]]]}, {"name": "activation_266", "class_name": "Activation", "config": {"name": "activation_266", "trainable": true, "activation": "sigmoid"}, "inbound_nodes": [[["conv2d_266", 0, 0, {}]]]}], "input_layers": [["input_14", 0, 0]], "output_layers": [["activation_266", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}