{"class_name": "Model", "keras_version": "2.0.9", "backend": "tensorflow", "config": {"name": "model_1", "layers": [{"class_name": "InputLayer", "name": "input_1", "inbound_nodes": [], "config": {"batch_input_shape": [null, 2, 128, 128], "name": "input_1", "sparse": false, "dtype": "float32"}}, {"class_name": "Conv2D", "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"filters": 16, "trainable": true, "use_bias": true, "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "strides": [1, 1], "kernel_constraint": null, "activation": "linear", "padding": "same", "name": "conv2d_1", "bias_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "Activation", "name": "activation_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_2", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"filters": 16, "trainable": true, "use_bias": true, "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "strides": [1, 1], "kernel_constraint": null, "activation": "linear", "padding": "same", "name": "conv2d_2", "bias_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "Activation", "name": "activation_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_1", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"padding": "valid", "name": "max_pooling2d_1", "trainable": true, "data_format": "channels_first", "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "Conv2D", "name": "conv2d_3", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"filters": 32, "trainable": true, "use_bias": true, "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "strides": [1, 1], "kernel_constraint": null, "activation": "linear", "padding": "same", "name": "conv2d_3", "bias_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "Activation", "name": "activation_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_3", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_4", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"filters": 32, "trainable": true, "use_bias": true, "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "strides": [1, 1], "kernel_constraint": null, "activation": "linear", "padding": "same", "name": "conv2d_4", "bias_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "Activation", "name": "activation_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_4", "trainable": true}}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"padding": "valid", "name": "max_pooling2d_2", "trainable": true, "data_format": "channels_first", "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "Conv2D", "name": "conv2d_5", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"filters": 64, "trainable": true, "use_bias": true, "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "strides": [1, 1], "kernel_constraint": null, "activation": "linear", "padding": "same", "name": "conv2d_5", "bias_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "Activation", "name": "activation_5", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_5", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_6", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "config": {"filters": 64, "trainable": true, "use_bias": true, "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "strides": [1, 1], "kernel_constraint": null, "activation": "linear", "padding": "same", "name": "conv2d_6", "bias_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "Activation", "name": "activation_6", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_6", "trainable": true}}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_3", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "config": {"padding": "valid", "name": "max_pooling2d_3", "trainable": true, "data_format": "channels_first", "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "Conv2D", "name": "conv2d_7", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "config": {"filters": 128, "trainable": true, "use_bias": true, "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "strides": [1, 1], "kernel_constraint": null, "activation": "linear", "padding": "same", "name": "conv2d_7", "bias_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "Activation", "name": "activation_7", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_7", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_8", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "config": {"filters": 128, "trainable": true, "use_bias": true, "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "strides": [1, 1], "kernel_constraint": null, "activation": "linear", "padding": "same", "name": "conv2d_8", "bias_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "Activation", "name": "activation_8", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_8", "trainable": true}}, {"class_name": "UpSampling2D", "name": "up_sampling2d_1", "inbound_nodes": [[["activation_8", 0, 0, {}]]], "config": {"name": "up_sampling2d_1", "size": [2, 2], "trainable": true, "data_format": "channels_first"}}, {"class_name": "Concatenate", "name": "concatenate_1", "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}], ["activation_6", 0, 0, {}]]], "config": {"axis": 1, "name": "concatenate_1", "trainable": true}}, {"class_name": "Dropout", "name": "dropout_1", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "config": {"rate": 0.5, "name": "dropout_1", "seed": null, "noise_shape": null, "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_9", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"filters": 64, "trainable": true, "use_bias": true, "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "strides": [1, 1], "kernel_constraint": null, "activation": "linear", "padding": "same", "name": "conv2d_9", "bias_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "Activation", "name": "activation_9", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_9", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_10", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "config": {"filters": 64, "trainable": true, "use_bias": true, "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "strides": [1, 1], "kernel_constraint": null, "activation": "linear", "padding": "same", "name": "conv2d_10", "bias_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "Activation", "name": "activation_10", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_10", "trainable": true}}, {"class_name": "UpSampling2D", "name": "up_sampling2d_2", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "config": {"name": "up_sampling2d_2", "size": [2, 2], "trainable": true, "data_format": "channels_first"}}, {"class_name": "Concatenate", "name": "concatenate_2", "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}], ["activation_4", 0, 0, {}]]], "config": {"axis": 1, "name": "concatenate_2", "trainable": true}}, {"class_name": "Dropout", "name": "dropout_2", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "config": {"rate": 0.5, "name": "dropout_2", "seed": null, "noise_shape": null, "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_11", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "config": {"filters": 32, "trainable": true, "use_bias": true, "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "strides": [1, 1], "kernel_constraint": null, "activation": "linear", "padding": "same", "name": "conv2d_11", "bias_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "Activation", "name": "activation_11", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_11", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_12", "inbound_nodes": [[["activation_11", 0, 0, {}]]], "config": {"filters": 32, "trainable": true, "use_bias": true, "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "strides": [1, 1], "kernel_constraint": null, "activation": "linear", "padding": "same", "name": "conv2d_12", "bias_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "Activation", "name": "activation_12", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_12", "trainable": true}}, {"class_name": "UpSampling2D", "name": "up_sampling2d_3", "inbound_nodes": [[["activation_12", 0, 0, {}]]], "config": {"name": "up_sampling2d_3", "size": [2, 2], "trainable": true, "data_format": "channels_first"}}, {"class_name": "Concatenate", "name": "concatenate_3", "inbound_nodes": [[["up_sampling2d_3", 0, 0, {}], ["activation_2", 0, 0, {}]]], "config": {"axis": 1, "name": "concatenate_3", "trainable": true}}, {"class_name": "Dropout", "name": "dropout_3", "inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "config": {"rate": 0.5, "name": "dropout_3", "seed": null, "noise_shape": null, "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_13", "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "config": {"filters": 16, "trainable": true, "use_bias": true, "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "strides": [1, 1], "kernel_constraint": null, "activation": "linear", "padding": "same", "name": "conv2d_13", "bias_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "Activation", "name": "activation_13", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_13", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_14", "inbound_nodes": [[["activation_13", 0, 0, {}]]], "config": {"filters": 16, "trainable": true, "use_bias": true, "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "strides": [1, 1], "kernel_constraint": null, "activation": "linear", "padding": "same", "name": "conv2d_14", "bias_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "Activation", "name": "activation_14", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_14", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_15", "inbound_nodes": [[["activation_14", 0, 0, {}]]], "config": {"filters": 1, "trainable": true, "use_bias": true, "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [1, 1], "strides": [1, 1], "kernel_constraint": null, "activation": "linear", "padding": "valid", "name": "conv2d_15", "bias_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "Activation", "name": "activation_15", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "config": {"activation": "sigmoid", "name": "activation_15", "trainable": true}}], "output_layers": [["activation_15", 0, 0]], "input_layers": [["input_1", 0, 0]]}}