{"class_name": "Model", "config": {"layers": [{"inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, 2, 128, 128], "dtype": "float32", "sparse": false, "name": "input_1"}, "name": "input_1"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "activation": "linear", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "kernel_regularizer": null, "filters": 16, "name": "conv2d_1", "strides": [1, 1], "padding": "same", "data_format": "channels_first", "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_1"}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "name": "activation_1"}, {"inbound_nodes": [[["activation_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "activation": "linear", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "kernel_regularizer": null, "filters": 16, "name": "conv2d_2", "strides": [1, 1], "padding": "same", "data_format": "channels_first", "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_2"}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "name": "activation_2"}, {"inbound_nodes": [[["activation_2", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "pool_size": [2, 2], "data_format": "channels_first", "strides": [2, 2], "padding": "valid"}, "name": "max_pooling2d_1"}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "activation": "linear", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "kernel_regularizer": null, "filters": 32, "name": "conv2d_3", "strides": [1, 1], "padding": "same", "data_format": "channels_first", "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_3"}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}, "name": "activation_3"}, {"inbound_nodes": [[["activation_3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "activation": "linear", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "kernel_regularizer": null, "filters": 32, "name": "conv2d_4", "strides": [1, 1], "padding": "same", "data_format": "channels_first", "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_4"}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_4"}, "name": "activation_4"}, {"inbound_nodes": [[["activation_4", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "pool_size": [2, 2], "data_format": "channels_first", "strides": [2, 2], "padding": "valid"}, "name": "max_pooling2d_2"}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "activation": "linear", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "kernel_regularizer": null, "filters": 64, "name": "conv2d_5", "strides": [1, 1], "padding": "same", "data_format": "channels_first", "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_5"}, {"inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_5"}, "name": "activation_5"}, {"inbound_nodes": [[["activation_5", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "activation": "linear", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "kernel_regularizer": null, "filters": 64, "name": "conv2d_6", "strides": [1, 1], "padding": "same", "data_format": "channels_first", "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_6"}, {"inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_6"}, "name": "activation_6"}, {"inbound_nodes": [[["activation_6", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "trainable": true, "pool_size": [2, 2], "data_format": "channels_first", "strides": [2, 2], "padding": "valid"}, "name": "max_pooling2d_3"}, {"inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "activation": "linear", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "kernel_regularizer": null, "filters": 128, "name": "conv2d_7", "strides": [1, 1], "padding": "same", "data_format": "channels_first", "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_7"}, {"inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_7"}, "name": "activation_7"}, {"inbound_nodes": [[["activation_7", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "activation": "linear", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "kernel_regularizer": null, "filters": 128, "name": "conv2d_8", "strides": [1, 1], "padding": "same", "data_format": "channels_first", "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_8"}, {"inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_8"}, "name": "activation_8"}, {"inbound_nodes": [[["activation_8", 0, 0, {}]]], "class_name": "UpSampling2D", "config": {"trainable": true, "data_format": "channels_first", "size": [2, 2], "name": "up_sampling2d_1"}, "name": "up_sampling2d_1"}, {"inbound_nodes": [[["up_sampling2d_1", 0, 0, {}], ["activation_6", 0, 0, {}]]], "class_name": "Concatenate", "config": {"trainable": true, "axis": 1, "name": "concatenate_1"}, "name": "concatenate_1"}, {"inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.5, "seed": null, "noise_shape": null}, "name": "dropout_1"}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "activation": "linear", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "kernel_regularizer": null, "filters": 64, "name": "conv2d_9", "strides": [1, 1], "padding": "same", "data_format": "channels_first", "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_9"}, {"inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_9"}, "name": "activation_9"}, {"inbound_nodes": [[["activation_9", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "activation": "linear", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "kernel_regularizer": null, "filters": 64, "name": "conv2d_10", "strides": [1, 1], "padding": "same", "data_format": "channels_first", "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_10"}, {"inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_10"}, "name": "activation_10"}, {"inbound_nodes": [[["activation_10", 0, 0, {}]]], "class_name": "UpSampling2D", "config": {"trainable": true, "data_format": "channels_first", "size": [2, 2], "name": "up_sampling2d_2"}, "name": "up_sampling2d_2"}, {"inbound_nodes": [[["up_sampling2d_2", 0, 0, {}], ["activation_4", 0, 0, {}]]], "class_name": "Concatenate", "config": {"trainable": true, "axis": 1, "name": "concatenate_2"}, "name": "concatenate_2"}, {"inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.5, "seed": null, "noise_shape": null}, "name": "dropout_2"}, {"inbound_nodes": [[["dropout_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "activation": "linear", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "kernel_regularizer": null, "filters": 32, "name": "conv2d_11", "strides": [1, 1], "padding": "same", "data_format": "channels_first", "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_11"}, {"inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_11"}, "name": "activation_11"}, {"inbound_nodes": [[["activation_11", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "activation": "linear", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "kernel_regularizer": null, "filters": 32, "name": "conv2d_12", "strides": [1, 1], "padding": "same", "data_format": "channels_first", "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_12"}, {"inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_12"}, "name": "activation_12"}, {"inbound_nodes": [[["activation_12", 0, 0, {}]]], "class_name": "UpSampling2D", "config": {"trainable": true, "data_format": "channels_first", "size": [2, 2], "name": "up_sampling2d_3"}, "name": "up_sampling2d_3"}, {"inbound_nodes": [[["up_sampling2d_3", 0, 0, {}], ["activation_2", 0, 0, {}]]], "class_name": "Concatenate", "config": {"trainable": true, "axis": 1, "name": "concatenate_3"}, "name": "concatenate_3"}, {"inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "rate": 0.5, "seed": null, "noise_shape": null}, "name": "dropout_3"}, {"inbound_nodes": [[["dropout_3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "activation": "linear", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "kernel_regularizer": null, "filters": 16, "name": "conv2d_13", "strides": [1, 1], "padding": "same", "data_format": "channels_first", "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_13"}, {"inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_13"}, "name": "activation_13"}, {"inbound_nodes": [[["activation_13", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "activation": "linear", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "kernel_regularizer": null, "filters": 16, "name": "conv2d_14", "strides": [1, 1], "padding": "same", "data_format": "channels_first", "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_14"}, {"inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_14"}, "name": "activation_14"}, {"inbound_nodes": [[["activation_14", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_constraint": null, "activation": "linear", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "use_bias": true, "kernel_regularizer": null, "filters": 1, "name": "conv2d_15", "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "conv2d_15"}, {"inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "sigmoid", "name": "activation_15"}, "name": "activation_15"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["activation_15", 0, 0]], "name": "model_1"}, "keras_version": "2.0.9", "backend": "tensorflow"}