{"class_name": "Model", "config": {"name": "model_13", "layers": [{"name": "input_7", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false, "name": "input_7"}, "inbound_nodes": []}, {"name": "conv2d_115", "class_name": "Conv2D", "config": {"name": "conv2d_115", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_7", 0, 0, {}]]]}, {"name": "activation_115", "class_name": "Activation", "config": {"name": "activation_115", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_115", 0, 0, {}]]]}, {"name": "conv2d_116", "class_name": "Conv2D", "config": {"name": "conv2d_116", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_115", 0, 0, {}]]]}, {"name": "activation_116", "class_name": "Activation", "config": {"name": "activation_116", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_116", 0, 0, {}]]]}, {"name": "max_pooling2d_25", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_25", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_116", 0, 0, {}]]]}, {"name": "conv2d_117", "class_name": "Conv2D", "config": {"name": "conv2d_117", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_25", 0, 0, {}]]]}, {"name": "activation_117", "class_name": "Activation", "config": {"name": "activation_117", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_117", 0, 0, {}]]]}, {"name": "conv2d_118", "class_name": "Conv2D", "config": {"name": "conv2d_118", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_117", 0, 0, {}]]]}, {"name": "activation_118", "class_name": "Activation", "config": {"name": "activation_118", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_118", 0, 0, {}]]]}, {"name": "max_pooling2d_26", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_26", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_118", 0, 0, {}]]]}, {"name": "conv2d_119", "class_name": "Conv2D", "config": {"name": "conv2d_119", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_26", 0, 0, {}]]]}, {"name": "activation_119", "class_name": "Activation", "config": {"name": "activation_119", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_119", 0, 0, {}]]]}, {"name": "conv2d_120", "class_name": "Conv2D", "config": {"name": "conv2d_120", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_119", 0, 0, {}]]]}, {"name": "activation_120", "class_name": "Activation", "config": {"name": "activation_120", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_120", 0, 0, {}]]]}, {"name": "max_pooling2d_27", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_27", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_120", 0, 0, {}]]]}, {"name": "conv2d_121", "class_name": "Conv2D", "config": {"name": "conv2d_121", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_27", 0, 0, {}]]]}, {"name": "activation_121", "class_name": "Activation", "config": {"name": "activation_121", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_121", 0, 0, {}]]]}, {"name": "conv2d_122", "class_name": "Conv2D", "config": {"name": "conv2d_122", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_121", 0, 0, {}]]]}, {"name": "activation_122", "class_name": "Activation", "config": {"name": "activation_122", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_122", 0, 0, {}]]]}, {"name": "max_pooling2d_28", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_28", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_122", 0, 0, {}]]]}, {"name": "conv2d_123", "class_name": "Conv2D", "config": {"name": "conv2d_123", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_28", 0, 0, {}]]]}, {"name": "activation_123", "class_name": "Activation", "config": {"name": "activation_123", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_123", 0, 0, {}]]]}, {"name": "conv2d_124", "class_name": "Conv2D", "config": {"name": "conv2d_124", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_123", 0, 0, {}]]]}, {"name": "activation_124", "class_name": "Activation", "config": {"name": "activation_124", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_124", 0, 0, {}]]]}, {"name": "up_sampling2d_25", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_25", "trainable": true, "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["activation_124", 0, 0, {}]]]}, {"name": "concatenate_25", "class_name": "Concatenate", "config": {"name": "concatenate_25", "trainable": true, "axis": -1}, "inbound_nodes": [[["up_sampling2d_25", 0, 0, {}], ["activation_122", 0, 0, {}]]]}, {"name": "conv2d_125", "class_name": "Conv2D", "config": {"name": "conv2d_125", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_25", 0, 0, {}]]]}, {"name": "activation_125", "class_name": "Activation", "config": {"name": "activation_125", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_125", 0, 0, {}]]]}, {"name": "conv2d_126", "class_name": "Conv2D", "config": {"name": "conv2d_126", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_125", 0, 0, {}]]]}, {"name": "activation_126", "class_name": "Activation", "config": {"name": "activation_126", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_126", 0, 0, {}]]]}, {"name": "up_sampling2d_26", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_26", "trainable": true, "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["activation_126", 0, 0, {}]]]}, {"name": "concatenate_26", "class_name": "Concatenate", "config": {"name": "concatenate_26", "trainable": true, "axis": -1}, "inbound_nodes": [[["up_sampling2d_26", 0, 0, {}], ["activation_120", 0, 0, {}]]]}, {"name": "conv2d_127", "class_name": "Conv2D", "config": {"name": "conv2d_127", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_26", 0, 0, {}]]]}, {"name": "activation_127", "class_name": "Activation", "config": {"name": "activation_127", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_127", 0, 0, {}]]]}, {"name": "conv2d_128", "class_name": "Conv2D", "config": {"name": "conv2d_128", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_127", 0, 0, {}]]]}, {"name": "activation_128", "class_name": "Activation", "config": {"name": "activation_128", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_128", 0, 0, {}]]]}, {"name": "up_sampling2d_27", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_27", "trainable": true, "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["activation_128", 0, 0, {}]]]}, {"name": "concatenate_27", "class_name": "Concatenate", "config": {"name": "concatenate_27", "trainable": true, "axis": -1}, "inbound_nodes": [[["up_sampling2d_27", 0, 0, {}], ["activation_118", 0, 0, {}]]]}, {"name": "conv2d_129", "class_name": "Conv2D", "config": {"name": "conv2d_129", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_27", 0, 0, {}]]]}, {"name": "activation_129", "class_name": "Activation", "config": {"name": "activation_129", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_129", 0, 0, {}]]]}, {"name": "conv2d_130", "class_name": "Conv2D", "config": {"name": "conv2d_130", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_129", 0, 0, {}]]]}, {"name": "activation_130", "class_name": "Activation", "config": {"name": "activation_130", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_130", 0, 0, {}]]]}, {"name": "up_sampling2d_28", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_28", "trainable": true, "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["activation_130", 0, 0, {}]]]}, {"name": "concatenate_28", "class_name": "Concatenate", "config": {"name": "concatenate_28", "trainable": true, "axis": -1}, "inbound_nodes": [[["up_sampling2d_28", 0, 0, {}], ["activation_116", 0, 0, {}]]]}, {"name": "conv2d_131", "class_name": "Conv2D", "config": {"name": "conv2d_131", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_28", 0, 0, {}]]]}, {"name": "activation_131", "class_name": "Activation", "config": {"name": "activation_131", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_131", 0, 0, {}]]]}, {"name": "conv2d_132", "class_name": "Conv2D", "config": {"name": "conv2d_132", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_131", 0, 0, {}]]]}, {"name": "activation_132", "class_name": "Activation", "config": {"name": "activation_132", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_132", 0, 0, {}]]]}, {"name": "conv2d_133", "class_name": "Conv2D", "config": {"name": "conv2d_133", "trainable": true, "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_132", 0, 0, {}]]]}, {"name": "activation_133", "class_name": "Activation", "config": {"name": "activation_133", "trainable": true, "activation": "sigmoid"}, "inbound_nodes": [[["conv2d_133", 0, 0, {}]]]}], "input_layers": [["input_7", 0, 0]], "output_layers": [["activation_133", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}