{"backend": "tensorflow", "keras_version": "2.0.9", "class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "inbound_nodes": [], "class_name": "InputLayer", "config": {"sparse": false, "batch_input_shape": [null, 1, 128, 128], "dtype": "float32", "name": "input_1"}}, {"name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_1", "padding": "same", "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "filters": 16, "trainable": true, "data_format": "channels_first", "use_bias": true}}, {"name": "activation_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"name": "conv2d_2", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_2", "padding": "same", "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "filters": 16, "trainable": true, "data_format": "channels_first", "use_bias": true}}, {"name": "activation_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}}, {"name": "max_pooling2d_1", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "strides": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_first", "padding": "valid"}}, {"name": "conv2d_3", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_3", "padding": "same", "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "filters": 32, "trainable": true, "data_format": "channels_first", "use_bias": true}}, {"name": "activation_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}}, {"name": "conv2d_4", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_4", "padding": "same", "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "filters": 32, "trainable": true, "data_format": "channels_first", "use_bias": true}}, {"name": "activation_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_4"}}, {"name": "max_pooling2d_2", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "strides": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_first", "padding": "valid"}}, {"name": "conv2d_5", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_5", "padding": "same", "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "filters": 64, "trainable": true, "data_format": "channels_first", "use_bias": true}}, {"name": "activation_5", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_5"}}, {"name": "conv2d_6", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_6", "padding": "same", "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "filters": 64, "trainable": true, "data_format": "channels_first", "use_bias": true}}, {"name": "activation_6", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_6"}}, {"name": "max_pooling2d_3", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "strides": [2, 2], "name": "max_pooling2d_3", "data_format": "channels_first", "padding": "valid"}}, {"name": "conv2d_7", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_7", "padding": "same", "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "filters": 128, "trainable": true, "data_format": "channels_first", "use_bias": true}}, {"name": "activation_7", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_7"}}, {"name": "conv2d_8", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_8", "padding": "same", "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "filters": 128, "trainable": true, "data_format": "channels_first", "use_bias": true}}, {"name": "activation_8", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_8"}}, {"name": "max_pooling2d_4", "inbound_nodes": [[["activation_8", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "strides": [2, 2], "name": "max_pooling2d_4", "data_format": "channels_first", "padding": "valid"}}, {"name": "conv2d_9", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_9", "padding": "same", "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "filters": 256, "trainable": true, "data_format": "channels_first", "use_bias": true}}, {"name": "activation_9", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_9"}}, {"name": "conv2d_10", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_10", "padding": "same", "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "filters": 256, "trainable": true, "data_format": "channels_first", "use_bias": true}}, {"name": "activation_10", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_10"}}, {"name": "up_sampling2d_1", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "class_name": "UpSampling2D", "config": {"trainable": true, "data_format": "channels_first", "size": [2, 2], "name": "up_sampling2d_1"}}, {"name": "concatenate_1", "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}], ["activation_8", 0, 0, {}]]], "class_name": "Concatenate", "config": {"trainable": true, "axis": 1, "name": "concatenate_1"}}, {"name": "conv2d_11", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_11", "padding": "same", "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "filters": 128, "trainable": true, "data_format": "channels_first", "use_bias": true}}, {"name": "activation_11", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_11"}}, {"name": "conv2d_12", "inbound_nodes": [[["activation_11", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_12", "padding": "same", "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "filters": 128, "trainable": true, "data_format": "channels_first", "use_bias": true}}, {"name": "activation_12", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_12"}}, {"name": "up_sampling2d_2", "inbound_nodes": [[["activation_12", 0, 0, {}]]], "class_name": "UpSampling2D", "config": {"trainable": true, "data_format": "channels_first", "size": [2, 2], "name": "up_sampling2d_2"}}, {"name": "concatenate_2", "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}], ["activation_6", 0, 0, {}]]], "class_name": "Concatenate", "config": {"trainable": true, "axis": 1, "name": "concatenate_2"}}, {"name": "conv2d_13", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_13", "padding": "same", "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "filters": 64, "trainable": true, "data_format": "channels_first", "use_bias": true}}, {"name": "activation_13", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_13"}}, {"name": "conv2d_14", "inbound_nodes": [[["activation_13", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_14", "padding": "same", "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "filters": 64, "trainable": true, "data_format": "channels_first", "use_bias": true}}, {"name": "activation_14", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_14"}}, {"name": "up_sampling2d_3", "inbound_nodes": [[["activation_14", 0, 0, {}]]], "class_name": "UpSampling2D", "config": {"trainable": true, "data_format": "channels_first", "size": [2, 2], "name": "up_sampling2d_3"}}, {"name": "concatenate_3", "inbound_nodes": [[["up_sampling2d_3", 0, 0, {}], ["activation_4", 0, 0, {}]]], "class_name": "Concatenate", "config": {"trainable": true, "axis": 1, "name": "concatenate_3"}}, {"name": "conv2d_15", "inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_15", "padding": "same", "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "filters": 32, "trainable": true, "data_format": "channels_first", "use_bias": true}}, {"name": "activation_15", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_15"}}, {"name": "conv2d_16", "inbound_nodes": [[["activation_15", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_16", "padding": "same", "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "filters": 32, "trainable": true, "data_format": "channels_first", "use_bias": true}}, {"name": "activation_16", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_16"}}, {"name": "up_sampling2d_4", "inbound_nodes": [[["activation_16", 0, 0, {}]]], "class_name": "UpSampling2D", "config": {"trainable": true, "data_format": "channels_first", "size": [2, 2], "name": "up_sampling2d_4"}}, {"name": "concatenate_4", "inbound_nodes": [[["up_sampling2d_4", 0, 0, {}], ["activation_2", 0, 0, {}]]], "class_name": "Concatenate", "config": {"trainable": true, "axis": 1, "name": "concatenate_4"}}, {"name": "conv2d_17", "inbound_nodes": [[["concatenate_4", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_17", "padding": "same", "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "filters": 16, "trainable": true, "data_format": "channels_first", "use_bias": true}}, {"name": "activation_17", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_17"}}, {"name": "conv2d_18", "inbound_nodes": [[["activation_17", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_18", "padding": "same", "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "filters": 16, "trainable": true, "data_format": "channels_first", "use_bias": true}}, {"name": "activation_18", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_18"}}, {"name": "conv2d_19", "inbound_nodes": [[["activation_18", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_19", "padding": "valid", "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "filters": 2, "trainable": true, "data_format": "channels_first", "use_bias": true}}, {"name": "activation_19", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "sigmoid", "name": "activation_19"}}], "output_layers": [["activation_19", 0, 0]], "name": "model_1"}}