{"class_name": "Model", "config": {"name": "model_23", "layers": [{"name": "input_12", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 1], "dtype": "float32", "sparse": false, "name": "input_12"}, "inbound_nodes": []}, {"name": "conv2d_210", "class_name": "Conv2D", "config": {"name": "conv2d_210", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_12", 0, 0, {}]]]}, {"name": "activation_210", "class_name": "Activation", "config": {"name": "activation_210", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_210", 0, 0, {}]]]}, {"name": "conv2d_211", "class_name": "Conv2D", "config": {"name": "conv2d_211", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_210", 0, 0, {}]]]}, {"name": "activation_211", "class_name": "Activation", "config": {"name": "activation_211", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_211", 0, 0, {}]]]}, {"name": "max_pooling2d_45", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_45", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_211", 0, 0, {}]]]}, {"name": "conv2d_212", "class_name": "Conv2D", "config": {"name": "conv2d_212", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_45", 0, 0, {}]]]}, {"name": "activation_212", "class_name": "Activation", "config": {"name": "activation_212", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_212", 0, 0, {}]]]}, {"name": "conv2d_213", "class_name": "Conv2D", "config": {"name": "conv2d_213", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_212", 0, 0, {}]]]}, {"name": "activation_213", "class_name": "Activation", "config": {"name": "activation_213", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_213", 0, 0, {}]]]}, {"name": "max_pooling2d_46", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_46", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_213", 0, 0, {}]]]}, {"name": "conv2d_214", "class_name": "Conv2D", "config": {"name": "conv2d_214", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_46", 0, 0, {}]]]}, {"name": "activation_214", "class_name": "Activation", "config": {"name": "activation_214", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_214", 0, 0, {}]]]}, {"name": "conv2d_215", "class_name": "Conv2D", "config": {"name": "conv2d_215", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_214", 0, 0, {}]]]}, {"name": "activation_215", "class_name": "Activation", "config": {"name": "activation_215", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_215", 0, 0, {}]]]}, {"name": "max_pooling2d_47", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_47", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_215", 0, 0, {}]]]}, {"name": "conv2d_216", "class_name": "Conv2D", "config": {"name": "conv2d_216", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_47", 0, 0, {}]]]}, {"name": "activation_216", "class_name": "Activation", "config": {"name": "activation_216", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_216", 0, 0, {}]]]}, {"name": "conv2d_217", "class_name": "Conv2D", "config": {"name": "conv2d_217", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_216", 0, 0, {}]]]}, {"name": "activation_217", "class_name": "Activation", "config": {"name": "activation_217", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_217", 0, 0, {}]]]}, {"name": "max_pooling2d_48", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_48", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_217", 0, 0, {}]]]}, {"name": "conv2d_218", "class_name": "Conv2D", "config": {"name": "conv2d_218", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_48", 0, 0, {}]]]}, {"name": "activation_218", "class_name": "Activation", "config": {"name": "activation_218", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_218", 0, 0, {}]]]}, {"name": "conv2d_219", "class_name": "Conv2D", "config": {"name": "conv2d_219", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_218", 0, 0, {}]]]}, {"name": "activation_219", "class_name": "Activation", "config": {"name": "activation_219", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_219", 0, 0, {}]]]}, {"name": "up_sampling2d_45", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_45", "trainable": true, "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["activation_219", 0, 0, {}]]]}, {"name": "concatenate_45", "class_name": "Concatenate", "config": {"name": "concatenate_45", "trainable": true, "axis": -1}, "inbound_nodes": [[["up_sampling2d_45", 0, 0, {}], ["activation_217", 0, 0, {}]]]}, {"name": "conv2d_220", "class_name": "Conv2D", "config": {"name": "conv2d_220", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_45", 0, 0, {}]]]}, {"name": "activation_220", "class_name": "Activation", "config": {"name": "activation_220", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_220", 0, 0, {}]]]}, {"name": "conv2d_221", "class_name": "Conv2D", "config": {"name": "conv2d_221", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_220", 0, 0, {}]]]}, {"name": "activation_221", "class_name": "Activation", "config": {"name": "activation_221", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_221", 0, 0, {}]]]}, {"name": "up_sampling2d_46", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_46", "trainable": true, "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["activation_221", 0, 0, {}]]]}, {"name": "concatenate_46", "class_name": "Concatenate", "config": {"name": "concatenate_46", "trainable": true, "axis": -1}, "inbound_nodes": [[["up_sampling2d_46", 0, 0, {}], ["activation_215", 0, 0, {}]]]}, {"name": "conv2d_222", "class_name": "Conv2D", "config": {"name": "conv2d_222", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_46", 0, 0, {}]]]}, {"name": "activation_222", "class_name": "Activation", "config": {"name": "activation_222", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_222", 0, 0, {}]]]}, {"name": "conv2d_223", "class_name": "Conv2D", "config": {"name": "conv2d_223", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_222", 0, 0, {}]]]}, {"name": "activation_223", "class_name": "Activation", "config": {"name": "activation_223", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_223", 0, 0, {}]]]}, {"name": "up_sampling2d_47", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_47", "trainable": true, "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["activation_223", 0, 0, {}]]]}, {"name": "concatenate_47", "class_name": "Concatenate", "config": {"name": "concatenate_47", "trainable": true, "axis": -1}, "inbound_nodes": [[["up_sampling2d_47", 0, 0, {}], ["activation_213", 0, 0, {}]]]}, {"name": "conv2d_224", "class_name": "Conv2D", "config": {"name": "conv2d_224", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_47", 0, 0, {}]]]}, {"name": "activation_224", "class_name": "Activation", "config": {"name": "activation_224", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_224", 0, 0, {}]]]}, {"name": "conv2d_225", "class_name": "Conv2D", "config": {"name": "conv2d_225", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_224", 0, 0, {}]]]}, {"name": "activation_225", "class_name": "Activation", "config": {"name": "activation_225", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_225", 0, 0, {}]]]}, {"name": "up_sampling2d_48", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_48", "trainable": true, "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["activation_225", 0, 0, {}]]]}, {"name": "concatenate_48", "class_name": "Concatenate", "config": {"name": "concatenate_48", "trainable": true, "axis": -1}, "inbound_nodes": [[["up_sampling2d_48", 0, 0, {}], ["activation_211", 0, 0, {}]]]}, {"name": "conv2d_226", "class_name": "Conv2D", "config": {"name": "conv2d_226", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_48", 0, 0, {}]]]}, {"name": "activation_226", "class_name": "Activation", "config": {"name": "activation_226", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_226", 0, 0, {}]]]}, {"name": "conv2d_227", "class_name": "Conv2D", "config": {"name": "conv2d_227", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_226", 0, 0, {}]]]}, {"name": "activation_227", "class_name": "Activation", "config": {"name": "activation_227", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_227", 0, 0, {}]]]}, {"name": "conv2d_228", "class_name": "Conv2D", "config": {"name": "conv2d_228", "trainable": true, "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_227", 0, 0, {}]]]}, {"name": "activation_228", "class_name": "Activation", "config": {"name": "activation_228", "trainable": true, "activation": "sigmoid"}, "inbound_nodes": [[["conv2d_228", 0, 0, {}]]]}], "input_layers": [["input_12", 0, 0]], "output_layers": [["activation_228", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}