{"class_name": "Model", "config": {"name": "model_17", "layers": [{"name": "input_9", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 1], "dtype": "float32", "sparse": false, "name": "input_9"}, "inbound_nodes": []}, {"name": "conv2d_153", "class_name": "Conv2D", "config": {"name": "conv2d_153", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_9", 0, 0, {}]]]}, {"name": "activation_153", "class_name": "Activation", "config": {"name": "activation_153", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_153", 0, 0, {}]]]}, {"name": "conv2d_154", "class_name": "Conv2D", "config": {"name": "conv2d_154", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_153", 0, 0, {}]]]}, {"name": "activation_154", "class_name": "Activation", "config": {"name": "activation_154", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_154", 0, 0, {}]]]}, {"name": "max_pooling2d_33", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_33", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_154", 0, 0, {}]]]}, {"name": "conv2d_155", "class_name": "Conv2D", "config": {"name": "conv2d_155", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_33", 0, 0, {}]]]}, {"name": "activation_155", "class_name": "Activation", "config": {"name": "activation_155", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_155", 0, 0, {}]]]}, {"name": "conv2d_156", "class_name": "Conv2D", "config": {"name": "conv2d_156", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_155", 0, 0, {}]]]}, {"name": "activation_156", "class_name": "Activation", "config": {"name": "activation_156", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_156", 0, 0, {}]]]}, {"name": "max_pooling2d_34", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_34", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_156", 0, 0, {}]]]}, {"name": "conv2d_157", "class_name": "Conv2D", "config": {"name": "conv2d_157", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_34", 0, 0, {}]]]}, {"name": "activation_157", "class_name": "Activation", "config": {"name": "activation_157", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_157", 0, 0, {}]]]}, {"name": "conv2d_158", "class_name": "Conv2D", "config": {"name": "conv2d_158", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_157", 0, 0, {}]]]}, {"name": "activation_158", "class_name": "Activation", "config": {"name": "activation_158", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_158", 0, 0, {}]]]}, {"name": "max_pooling2d_35", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_35", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_158", 0, 0, {}]]]}, {"name": "conv2d_159", "class_name": "Conv2D", "config": {"name": "conv2d_159", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_35", 0, 0, {}]]]}, {"name": "activation_159", "class_name": "Activation", "config": {"name": "activation_159", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_159", 0, 0, {}]]]}, {"name": "conv2d_160", "class_name": "Conv2D", "config": {"name": "conv2d_160", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_159", 0, 0, {}]]]}, {"name": "activation_160", "class_name": "Activation", "config": {"name": "activation_160", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_160", 0, 0, {}]]]}, {"name": "max_pooling2d_36", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_36", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_160", 0, 0, {}]]]}, {"name": "conv2d_161", "class_name": "Conv2D", "config": {"name": "conv2d_161", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_36", 0, 0, {}]]]}, {"name": "activation_161", "class_name": "Activation", "config": {"name": "activation_161", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_161", 0, 0, {}]]]}, {"name": "conv2d_162", "class_name": "Conv2D", "config": {"name": "conv2d_162", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_161", 0, 0, {}]]]}, {"name": "activation_162", "class_name": "Activation", "config": {"name": "activation_162", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_162", 0, 0, {}]]]}, {"name": "up_sampling2d_33", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_33", "trainable": true, "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["activation_162", 0, 0, {}]]]}, {"name": "concatenate_33", "class_name": "Concatenate", "config": {"name": "concatenate_33", "trainable": true, "axis": -1}, "inbound_nodes": [[["up_sampling2d_33", 0, 0, {}], ["activation_160", 0, 0, {}]]]}, {"name": "conv2d_163", "class_name": "Conv2D", "config": {"name": "conv2d_163", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_33", 0, 0, {}]]]}, {"name": "activation_163", "class_name": "Activation", "config": {"name": "activation_163", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_163", 0, 0, {}]]]}, {"name": "conv2d_164", "class_name": "Conv2D", "config": {"name": "conv2d_164", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_163", 0, 0, {}]]]}, {"name": "activation_164", "class_name": "Activation", "config": {"name": "activation_164", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_164", 0, 0, {}]]]}, {"name": "up_sampling2d_34", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_34", "trainable": true, "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["activation_164", 0, 0, {}]]]}, {"name": "concatenate_34", "class_name": "Concatenate", "config": {"name": "concatenate_34", "trainable": true, "axis": -1}, "inbound_nodes": [[["up_sampling2d_34", 0, 0, {}], ["activation_158", 0, 0, {}]]]}, {"name": "conv2d_165", "class_name": "Conv2D", "config": {"name": "conv2d_165", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_34", 0, 0, {}]]]}, {"name": "activation_165", "class_name": "Activation", "config": {"name": "activation_165", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_165", 0, 0, {}]]]}, {"name": "conv2d_166", "class_name": "Conv2D", "config": {"name": "conv2d_166", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_165", 0, 0, {}]]]}, {"name": "activation_166", "class_name": "Activation", "config": {"name": "activation_166", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_166", 0, 0, {}]]]}, {"name": "up_sampling2d_35", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_35", "trainable": true, "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["activation_166", 0, 0, {}]]]}, {"name": "concatenate_35", "class_name": "Concatenate", "config": {"name": "concatenate_35", "trainable": true, "axis": -1}, "inbound_nodes": [[["up_sampling2d_35", 0, 0, {}], ["activation_156", 0, 0, {}]]]}, {"name": "conv2d_167", "class_name": "Conv2D", "config": {"name": "conv2d_167", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_35", 0, 0, {}]]]}, {"name": "activation_167", "class_name": "Activation", "config": {"name": "activation_167", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_167", 0, 0, {}]]]}, {"name": "conv2d_168", "class_name": "Conv2D", "config": {"name": "conv2d_168", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_167", 0, 0, {}]]]}, {"name": "activation_168", "class_name": "Activation", "config": {"name": "activation_168", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_168", 0, 0, {}]]]}, {"name": "up_sampling2d_36", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_36", "trainable": true, "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["activation_168", 0, 0, {}]]]}, {"name": "concatenate_36", "class_name": "Concatenate", "config": {"name": "concatenate_36", "trainable": true, "axis": -1}, "inbound_nodes": [[["up_sampling2d_36", 0, 0, {}], ["activation_154", 0, 0, {}]]]}, {"name": "conv2d_169", "class_name": "Conv2D", "config": {"name": "conv2d_169", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_36", 0, 0, {}]]]}, {"name": "activation_169", "class_name": "Activation", "config": {"name": "activation_169", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_169", 0, 0, {}]]]}, {"name": "conv2d_170", "class_name": "Conv2D", "config": {"name": "conv2d_170", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_169", 0, 0, {}]]]}, {"name": "activation_170", "class_name": "Activation", "config": {"name": "activation_170", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_170", 0, 0, {}]]]}, {"name": "conv2d_171", "class_name": "Conv2D", "config": {"name": "conv2d_171", "trainable": true, "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_170", 0, 0, {}]]]}, {"name": "activation_171", "class_name": "Activation", "config": {"name": "activation_171", "trainable": true, "activation": "sigmoid"}, "inbound_nodes": [[["conv2d_171", 0, 0, {}]]]}], "input_layers": [["input_9", 0, 0]], "output_layers": [["activation_171", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}