{"class_name": "Model", "config": {"name": "model_31", "layers": [{"name": "input_16", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false, "name": "input_16"}, "inbound_nodes": []}, {"name": "conv2d_323", "class_name": "Conv2D", "config": {"name": "conv2d_323", "trainable": true, "filters": 4, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_16", 0, 0, {}]]]}, {"name": "conv2d_325", "class_name": "Conv2D", "config": {"name": "conv2d_325", "trainable": true, "filters": 4, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_16", 0, 0, {}]]]}, {"name": "max_pooling2d_70", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_70", "trainable": true, "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "inbound_nodes": [[["input_16", 0, 0, {}]]]}, {"name": "conv2d_322", "class_name": "Conv2D", "config": {"name": "conv2d_322", "trainable": true, "filters": 4, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_16", 0, 0, {}]]]}, {"name": "conv2d_324", "class_name": "Conv2D", "config": {"name": "conv2d_324", "trainable": true, "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_323", 0, 0, {}]]]}, {"name": "conv2d_326", "class_name": "Conv2D", "config": {"name": "conv2d_326", "trainable": true, "filters": 4, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_325", 0, 0, {}]]]}, {"name": "conv2d_327", "class_name": "Conv2D", "config": {"name": "conv2d_327", "trainable": true, "filters": 4, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_70", 0, 0, {}]]]}, {"name": "concatenate_70", "class_name": "Concatenate", "config": {"name": "concatenate_70", "trainable": true, "axis": -1}, "inbound_nodes": [[["conv2d_322", 0, 0, {}], ["conv2d_324", 0, 0, {}], ["conv2d_326", 0, 0, {}], ["conv2d_327", 0, 0, {}]]]}, {"name": "activation_277", "class_name": "Activation", "config": {"name": "activation_277", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["concatenate_70", 0, 0, {}]]]}, {"name": "max_pooling2d_71", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_71", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_277", 0, 0, {}]]]}, {"name": "conv2d_329", "class_name": "Conv2D", "config": {"name": "conv2d_329", "trainable": true, "filters": 8, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_71", 0, 0, {}]]]}, {"name": "conv2d_331", "class_name": "Conv2D", "config": {"name": "conv2d_331", "trainable": true, "filters": 8, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_71", 0, 0, {}]]]}, {"name": "max_pooling2d_72", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_72", "trainable": true, "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling2d_71", 0, 0, {}]]]}, {"name": "conv2d_328", "class_name": "Conv2D", "config": {"name": "conv2d_328", "trainable": true, "filters": 8, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_71", 0, 0, {}]]]}, {"name": "conv2d_330", "class_name": "Conv2D", "config": {"name": "conv2d_330", "trainable": true, "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_329", 0, 0, {}]]]}, {"name": "conv2d_332", "class_name": "Conv2D", "config": {"name": "conv2d_332", "trainable": true, "filters": 8, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_331", 0, 0, {}]]]}, {"name": "conv2d_333", "class_name": "Conv2D", "config": {"name": "conv2d_333", "trainable": true, "filters": 8, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_72", 0, 0, {}]]]}, {"name": "concatenate_71", "class_name": "Concatenate", "config": {"name": "concatenate_71", "trainable": true, "axis": -1}, "inbound_nodes": [[["conv2d_328", 0, 0, {}], ["conv2d_330", 0, 0, {}], ["conv2d_332", 0, 0, {}], ["conv2d_333", 0, 0, {}]]]}, {"name": "activation_278", "class_name": "Activation", "config": {"name": "activation_278", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["concatenate_71", 0, 0, {}]]]}, {"name": "max_pooling2d_73", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_73", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_278", 0, 0, {}]]]}, {"name": "conv2d_335", "class_name": "Conv2D", "config": {"name": "conv2d_335", "trainable": true, "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_73", 0, 0, {}]]]}, {"name": "conv2d_337", "class_name": "Conv2D", "config": {"name": "conv2d_337", "trainable": true, "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_73", 0, 0, {}]]]}, {"name": "max_pooling2d_74", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_74", "trainable": true, "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling2d_73", 0, 0, {}]]]}, {"name": "conv2d_334", "class_name": "Conv2D", "config": {"name": "conv2d_334", "trainable": true, "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_73", 0, 0, {}]]]}, {"name": "conv2d_336", "class_name": "Conv2D", "config": {"name": "conv2d_336", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_335", 0, 0, {}]]]}, {"name": "conv2d_338", "class_name": "Conv2D", "config": {"name": "conv2d_338", "trainable": true, "filters": 16, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_337", 0, 0, {}]]]}, {"name": "conv2d_339", "class_name": "Conv2D", "config": {"name": "conv2d_339", "trainable": true, "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_74", 0, 0, {}]]]}, {"name": "concatenate_72", "class_name": "Concatenate", "config": {"name": "concatenate_72", "trainable": true, "axis": -1}, "inbound_nodes": [[["conv2d_334", 0, 0, {}], ["conv2d_336", 0, 0, {}], ["conv2d_338", 0, 0, {}], ["conv2d_339", 0, 0, {}]]]}, {"name": "activation_279", "class_name": "Activation", "config": {"name": "activation_279", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["concatenate_72", 0, 0, {}]]]}, {"name": "max_pooling2d_75", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_75", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_279", 0, 0, {}]]]}, {"name": "conv2d_341", "class_name": "Conv2D", "config": {"name": "conv2d_341", "trainable": true, "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_75", 0, 0, {}]]]}, {"name": "conv2d_343", "class_name": "Conv2D", "config": {"name": "conv2d_343", "trainable": true, "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_75", 0, 0, {}]]]}, {"name": "max_pooling2d_76", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_76", "trainable": true, "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling2d_75", 0, 0, {}]]]}, {"name": "conv2d_340", "class_name": "Conv2D", "config": {"name": "conv2d_340", "trainable": true, "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_75", 0, 0, {}]]]}, {"name": "conv2d_342", "class_name": "Conv2D", "config": {"name": "conv2d_342", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_341", 0, 0, {}]]]}, {"name": "conv2d_344", "class_name": "Conv2D", "config": {"name": "conv2d_344", "trainable": true, "filters": 32, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_343", 0, 0, {}]]]}, {"name": "conv2d_345", "class_name": "Conv2D", "config": {"name": "conv2d_345", "trainable": true, "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_76", 0, 0, {}]]]}, {"name": "concatenate_73", "class_name": "Concatenate", "config": {"name": "concatenate_73", "trainable": true, "axis": -1}, "inbound_nodes": [[["conv2d_340", 0, 0, {}], ["conv2d_342", 0, 0, {}], ["conv2d_344", 0, 0, {}], ["conv2d_345", 0, 0, {}]]]}, {"name": "activation_280", "class_name": "Activation", "config": {"name": "activation_280", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["concatenate_73", 0, 0, {}]]]}, {"name": "max_pooling2d_77", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_77", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_280", 0, 0, {}]]]}, {"name": "conv2d_347", "class_name": "Conv2D", "config": {"name": "conv2d_347", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_77", 0, 0, {}]]]}, {"name": "conv2d_349", "class_name": "Conv2D", "config": {"name": "conv2d_349", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_77", 0, 0, {}]]]}, {"name": "max_pooling2d_78", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_78", "trainable": true, "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling2d_77", 0, 0, {}]]]}, {"name": "conv2d_346", "class_name": "Conv2D", "config": {"name": "conv2d_346", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_77", 0, 0, {}]]]}, {"name": "conv2d_348", "class_name": "Conv2D", "config": {"name": "conv2d_348", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_347", 0, 0, {}]]]}, {"name": "conv2d_350", "class_name": "Conv2D", "config": {"name": "conv2d_350", "trainable": true, "filters": 64, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_349", 0, 0, {}]]]}, {"name": "conv2d_351", "class_name": "Conv2D", "config": {"name": "conv2d_351", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_78", 0, 0, {}]]]}, {"name": "concatenate_74", "class_name": "Concatenate", "config": {"name": "concatenate_74", "trainable": true, "axis": -1}, "inbound_nodes": [[["conv2d_346", 0, 0, {}], ["conv2d_348", 0, 0, {}], ["conv2d_350", 0, 0, {}], ["conv2d_351", 0, 0, {}]]]}, {"name": "activation_281", "class_name": "Activation", "config": {"name": "activation_281", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["concatenate_74", 0, 0, {}]]]}, {"name": "up_sampling2d_61", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_61", "trainable": true, "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["activation_281", 0, 0, {}]]]}, {"name": "concatenate_75", "class_name": "Concatenate", "config": {"name": "concatenate_75", "trainable": true, "axis": -1}, "inbound_nodes": [[["up_sampling2d_61", 0, 0, {}], ["activation_280", 0, 0, {}]]]}, {"name": "conv2d_353", "class_name": "Conv2D", "config": {"name": "conv2d_353", "trainable": true, "filters": 4, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_75", 0, 0, {}]]]}, {"name": "conv2d_355", "class_name": "Conv2D", "config": {"name": "conv2d_355", "trainable": true, "filters": 4, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_75", 0, 0, {}]]]}, {"name": "max_pooling2d_79", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_79", "trainable": true, "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "inbound_nodes": [[["concatenate_75", 0, 0, {}]]]}, {"name": "conv2d_352", "class_name": "Conv2D", "config": {"name": "conv2d_352", "trainable": true, "filters": 4, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_75", 0, 0, {}]]]}, {"name": "conv2d_354", "class_name": "Conv2D", "config": {"name": "conv2d_354", "trainable": true, "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_353", 0, 0, {}]]]}, {"name": "conv2d_356", "class_name": "Conv2D", "config": {"name": "conv2d_356", "trainable": true, "filters": 4, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_355", 0, 0, {}]]]}, {"name": "conv2d_357", "class_name": "Conv2D", "config": {"name": "conv2d_357", "trainable": true, "filters": 4, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_79", 0, 0, {}]]]}, {"name": "concatenate_76", "class_name": "Concatenate", "config": {"name": "concatenate_76", "trainable": true, "axis": -1}, "inbound_nodes": [[["conv2d_352", 0, 0, {}], ["conv2d_354", 0, 0, {}], ["conv2d_356", 0, 0, {}], ["conv2d_357", 0, 0, {}]]]}, {"name": "activation_282", "class_name": "Activation", "config": {"name": "activation_282", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["concatenate_76", 0, 0, {}]]]}, {"name": "up_sampling2d_62", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_62", "trainable": true, "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["activation_282", 0, 0, {}]]]}, {"name": "concatenate_77", "class_name": "Concatenate", "config": {"name": "concatenate_77", "trainable": true, "axis": -1}, "inbound_nodes": [[["up_sampling2d_62", 0, 0, {}], ["activation_279", 0, 0, {}]]]}, {"name": "conv2d_359", "class_name": "Conv2D", "config": {"name": "conv2d_359", "trainable": true, "filters": 8, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_77", 0, 0, {}]]]}, {"name": "conv2d_361", "class_name": "Conv2D", "config": {"name": "conv2d_361", "trainable": true, "filters": 8, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_77", 0, 0, {}]]]}, {"name": "max_pooling2d_80", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_80", "trainable": true, "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "inbound_nodes": [[["concatenate_77", 0, 0, {}]]]}, {"name": "conv2d_358", "class_name": "Conv2D", "config": {"name": "conv2d_358", "trainable": true, "filters": 8, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_77", 0, 0, {}]]]}, {"name": "conv2d_360", "class_name": "Conv2D", "config": {"name": "conv2d_360", "trainable": true, "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_359", 0, 0, {}]]]}, {"name": "conv2d_362", "class_name": "Conv2D", "config": {"name": "conv2d_362", "trainable": true, "filters": 8, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_361", 0, 0, {}]]]}, {"name": "conv2d_363", "class_name": "Conv2D", "config": {"name": "conv2d_363", "trainable": true, "filters": 8, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_80", 0, 0, {}]]]}, {"name": "concatenate_78", "class_name": "Concatenate", "config": {"name": "concatenate_78", "trainable": true, "axis": -1}, "inbound_nodes": [[["conv2d_358", 0, 0, {}], ["conv2d_360", 0, 0, {}], ["conv2d_362", 0, 0, {}], ["conv2d_363", 0, 0, {}]]]}, {"name": "activation_283", "class_name": "Activation", "config": {"name": "activation_283", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["concatenate_78", 0, 0, {}]]]}, {"name": "up_sampling2d_63", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_63", "trainable": true, "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["activation_283", 0, 0, {}]]]}, {"name": "concatenate_79", "class_name": "Concatenate", "config": {"name": "concatenate_79", "trainable": true, "axis": -1}, "inbound_nodes": [[["up_sampling2d_63", 0, 0, {}], ["activation_278", 0, 0, {}]]]}, {"name": "conv2d_365", "class_name": "Conv2D", "config": {"name": "conv2d_365", "trainable": true, "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_79", 0, 0, {}]]]}, {"name": "conv2d_367", "class_name": "Conv2D", "config": {"name": "conv2d_367", "trainable": true, "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_79", 0, 0, {}]]]}, {"name": "max_pooling2d_81", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_81", "trainable": true, "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "inbound_nodes": [[["concatenate_79", 0, 0, {}]]]}, {"name": "conv2d_364", "class_name": "Conv2D", "config": {"name": "conv2d_364", "trainable": true, "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_79", 0, 0, {}]]]}, {"name": "conv2d_366", "class_name": "Conv2D", "config": {"name": "conv2d_366", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_365", 0, 0, {}]]]}, {"name": "conv2d_368", "class_name": "Conv2D", "config": {"name": "conv2d_368", "trainable": true, "filters": 16, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_367", 0, 0, {}]]]}, {"name": "conv2d_369", "class_name": "Conv2D", "config": {"name": "conv2d_369", "trainable": true, "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_81", 0, 0, {}]]]}, {"name": "concatenate_80", "class_name": "Concatenate", "config": {"name": "concatenate_80", "trainable": true, "axis": -1}, "inbound_nodes": [[["conv2d_364", 0, 0, {}], ["conv2d_366", 0, 0, {}], ["conv2d_368", 0, 0, {}], ["conv2d_369", 0, 0, {}]]]}, {"name": "activation_284", "class_name": "Activation", "config": {"name": "activation_284", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["concatenate_80", 0, 0, {}]]]}, {"name": "up_sampling2d_64", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_64", "trainable": true, "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["activation_284", 0, 0, {}]]]}, {"name": "concatenate_81", "class_name": "Concatenate", "config": {"name": "concatenate_81", "trainable": true, "axis": -1}, "inbound_nodes": [[["up_sampling2d_64", 0, 0, {}], ["activation_277", 0, 0, {}]]]}, {"name": "conv2d_371", "class_name": "Conv2D", "config": {"name": "conv2d_371", "trainable": true, "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_81", 0, 0, {}]]]}, {"name": "conv2d_373", "class_name": "Conv2D", "config": {"name": "conv2d_373", "trainable": true, "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_81", 0, 0, {}]]]}, {"name": "max_pooling2d_82", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_82", "trainable": true, "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "inbound_nodes": [[["concatenate_81", 0, 0, {}]]]}, {"name": "conv2d_370", "class_name": "Conv2D", "config": {"name": "conv2d_370", "trainable": true, "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_81", 0, 0, {}]]]}, {"name": "conv2d_372", "class_name": "Conv2D", "config": {"name": "conv2d_372", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_371", 0, 0, {}]]]}, {"name": "conv2d_374", "class_name": "Conv2D", "config": {"name": "conv2d_374", "trainable": true, "filters": 32, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_373", 0, 0, {}]]]}, {"name": "conv2d_375", "class_name": "Conv2D", "config": {"name": "conv2d_375", "trainable": true, "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_82", 0, 0, {}]]]}, {"name": "concatenate_82", "class_name": "Concatenate", "config": {"name": "concatenate_82", "trainable": true, "axis": -1}, "inbound_nodes": [[["conv2d_370", 0, 0, {}], ["conv2d_372", 0, 0, {}], ["conv2d_374", 0, 0, {}], ["conv2d_375", 0, 0, {}]]]}, {"name": "activation_285", "class_name": "Activation", "config": {"name": "activation_285", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["concatenate_82", 0, 0, {}]]]}, {"name": "conv2d_376", "class_name": "Conv2D", "config": {"name": "conv2d_376", "trainable": true, "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_285", 0, 0, {}]]]}, {"name": "activation_286", "class_name": "Activation", "config": {"name": "activation_286", "trainable": true, "activation": "sigmoid"}, "inbound_nodes": [[["conv2d_376", 0, 0, {}]]]}], "input_layers": [["input_16", 0, 0]], "output_layers": [["activation_286", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}