{"class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "name": "generator", "output_layers": [["activation_15", 0, 0]], "layers": [{"name": "input_1", "config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, 2, 128, 128], "name": "input_1"}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "conv2d_1", "config": {"activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "filters": 16, "trainable": true, "kernel_size": [3, 3], "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "kernel_constraint": null, "name": "conv2d_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_first", "kernel_regularizer": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "activation_1", "config": {"name": "activation_1", "activation": "relu", "trainable": true}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "Activation"}, {"name": "conv2d_2", "config": {"activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "filters": 16, "trainable": true, "kernel_size": [3, 3], "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "kernel_constraint": null, "name": "conv2d_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_first", "kernel_regularizer": null}, "inbound_nodes": [[["activation_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "activation_2", "config": {"name": "activation_2", "activation": "relu", "trainable": true}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "Activation"}, {"name": "max_pooling2d_1", "config": {"strides": [2, 2], "padding": "valid", "name": "max_pooling2d_1", "trainable": true, "data_format": "channels_first", "pool_size": [2, 2]}, "inbound_nodes": [[["activation_2", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "conv2d_3", "config": {"activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "filters": 32, "trainable": true, "kernel_size": [3, 3], "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "kernel_constraint": null, "name": "conv2d_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_first", "kernel_regularizer": null}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "activation_3", "config": {"name": "activation_3", "activation": "relu", "trainable": true}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "Activation"}, {"name": "conv2d_4", "config": {"activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "filters": 32, "trainable": true, "kernel_size": [3, 3], "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "kernel_constraint": null, "name": "conv2d_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_first", "kernel_regularizer": null}, "inbound_nodes": [[["activation_3", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "activation_4", "config": {"name": "activation_4", "activation": "relu", "trainable": true}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "Activation"}, {"name": "max_pooling2d_2", "config": {"strides": [2, 2], "padding": "valid", "name": "max_pooling2d_2", "trainable": true, "data_format": "channels_first", "pool_size": [2, 2]}, "inbound_nodes": [[["activation_4", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "conv2d_5", "config": {"activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "filters": 64, "trainable": true, "kernel_size": [3, 3], "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "kernel_constraint": null, "name": "conv2d_5", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_first", "kernel_regularizer": null}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "activation_5", "config": {"name": "activation_5", "activation": "relu", "trainable": true}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "Activation"}, {"name": "conv2d_6", "config": {"activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "filters": 64, "trainable": true, "kernel_size": [3, 3], "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "kernel_constraint": null, "name": "conv2d_6", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_first", "kernel_regularizer": null}, "inbound_nodes": [[["activation_5", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "activation_6", "config": {"name": "activation_6", "activation": "relu", "trainable": true}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "class_name": "Activation"}, {"name": "max_pooling2d_3", "config": {"strides": [2, 2], "padding": "valid", "name": "max_pooling2d_3", "trainable": true, "data_format": "channels_first", "pool_size": [2, 2]}, "inbound_nodes": [[["activation_6", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "conv2d_7", "config": {"activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "filters": 128, "trainable": true, "kernel_size": [3, 3], "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "kernel_constraint": null, "name": "conv2d_7", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_first", "kernel_regularizer": null}, "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "activation_7", "config": {"name": "activation_7", "activation": "relu", "trainable": true}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "class_name": "Activation"}, {"name": "conv2d_8", "config": {"activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "filters": 128, "trainable": true, "kernel_size": [3, 3], "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "kernel_constraint": null, "name": "conv2d_8", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_first", "kernel_regularizer": null}, "inbound_nodes": [[["activation_7", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "activation_8", "config": {"name": "activation_8", "activation": "relu", "trainable": true}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "class_name": "Activation"}, {"name": "up_sampling2d_1", "config": {"name": "up_sampling2d_1", "data_format": "channels_first", "size": [2, 2], "trainable": true}, "inbound_nodes": [[["activation_8", 0, 0, {}]]], "class_name": "UpSampling2D"}, {"name": "concatenate_1", "config": {"name": "concatenate_1", "trainable": true, "axis": 1}, "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}], ["activation_6", 0, 0, {}]]], "class_name": "Concatenate"}, {"name": "dropout_1", "config": {"noise_shape": null, "name": "dropout_1", "rate": 0.5, "trainable": true, "seed": null}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "conv2d_9", "config": {"activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "filters": 64, "trainable": true, "kernel_size": [3, 3], "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "kernel_constraint": null, "name": "conv2d_9", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_first", "kernel_regularizer": null}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "activation_9", "config": {"name": "activation_9", "activation": "relu", "trainable": true}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "class_name": "Activation"}, {"name": "conv2d_10", "config": {"activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "filters": 64, "trainable": true, "kernel_size": [3, 3], "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "kernel_constraint": null, "name": "conv2d_10", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_first", "kernel_regularizer": null}, "inbound_nodes": [[["activation_9", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "activation_10", "config": {"name": "activation_10", "activation": "relu", "trainable": true}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "class_name": "Activation"}, {"name": "up_sampling2d_2", "config": {"name": "up_sampling2d_2", "data_format": "channels_first", "size": [2, 2], "trainable": true}, "inbound_nodes": [[["activation_10", 0, 0, {}]]], "class_name": "UpSampling2D"}, {"name": "concatenate_2", "config": {"name": "concatenate_2", "trainable": true, "axis": 1}, "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}], ["activation_4", 0, 0, {}]]], "class_name": "Concatenate"}, {"name": "dropout_2", "config": {"noise_shape": null, "name": "dropout_2", "rate": 0.5, "trainable": true, "seed": null}, "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "conv2d_11", "config": {"activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "filters": 32, "trainable": true, "kernel_size": [3, 3], "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "kernel_constraint": null, "name": "conv2d_11", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_first", "kernel_regularizer": null}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "activation_11", "config": {"name": "activation_11", "activation": "relu", "trainable": true}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "class_name": "Activation"}, {"name": "conv2d_12", "config": {"activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "filters": 32, "trainable": true, "kernel_size": [3, 3], "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "kernel_constraint": null, "name": "conv2d_12", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_first", "kernel_regularizer": null}, "inbound_nodes": [[["activation_11", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "activation_12", "config": {"name": "activation_12", "activation": "relu", "trainable": true}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "class_name": "Activation"}, {"name": "up_sampling2d_3", "config": {"name": "up_sampling2d_3", "data_format": "channels_first", "size": [2, 2], "trainable": true}, "inbound_nodes": [[["activation_12", 0, 0, {}]]], "class_name": "UpSampling2D"}, {"name": "concatenate_3", "config": {"name": "concatenate_3", "trainable": true, "axis": 1}, "inbound_nodes": [[["up_sampling2d_3", 0, 0, {}], ["activation_2", 0, 0, {}]]], "class_name": "Concatenate"}, {"name": "dropout_3", "config": {"noise_shape": null, "name": "dropout_3", "rate": 0.5, "trainable": true, "seed": null}, "inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "conv2d_13", "config": {"activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "filters": 16, "trainable": true, "kernel_size": [3, 3], "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "kernel_constraint": null, "name": "conv2d_13", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_first", "kernel_regularizer": null}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "activation_13", "config": {"name": "activation_13", "activation": "relu", "trainable": true}, "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "class_name": "Activation"}, {"name": "conv2d_14", "config": {"activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "filters": 16, "trainable": true, "kernel_size": [3, 3], "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "kernel_constraint": null, "name": "conv2d_14", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_first", "kernel_regularizer": null}, "inbound_nodes": [[["activation_13", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "activation_14", "config": {"name": "activation_14", "activation": "relu", "trainable": true}, "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "class_name": "Activation"}, {"name": "conv2d_15", "config": {"activation": "linear", "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "filters": 1, "trainable": true, "kernel_size": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "kernel_constraint": null, "name": "conv2d_15", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "data_format": "channels_first", "kernel_regularizer": null}, "inbound_nodes": [[["activation_14", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "activation_15", "config": {"name": "activation_15", "activation": "sigmoid", "trainable": true}, "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "class_name": "Activation"}]}, "backend": "tensorflow", "keras_version": "2.0.9"}