{"class_name": "Model", "keras_version": "2.0.9", "backend": "tensorflow", "config": {"output_layers": [["activation_19", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"name": "input_1", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 1, 128, 128]}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "conv2d_1", "config": {"kernel_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "filters": 16, "strides": [1, 1], "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_1", "bias_constraint": null, "padding": "same"}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_1", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2", "config": {"kernel_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "filters": 16, "strides": [1, 1], "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_2", "bias_constraint": null, "padding": "same"}, "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_2", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_1", "config": {"strides": [2, 2], "data_format": "channels_first", "name": "max_pooling2d_1", "pool_size": [2, 2], "trainable": true, "padding": "valid"}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_3", "config": {"kernel_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "filters": 32, "strides": [1, 1], "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_3", "bias_constraint": null, "padding": "same"}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_3", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_4", "config": {"kernel_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "filters": 32, "strides": [1, 1], "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_4", "bias_constraint": null, "padding": "same"}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_4", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2", "config": {"strides": [2, 2], "data_format": "channels_first", "name": "max_pooling2d_2", "pool_size": [2, 2], "trainable": true, "padding": "valid"}, "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_5", "config": {"kernel_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "filters": 64, "strides": [1, 1], "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_5", "bias_constraint": null, "padding": "same"}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_5", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_6", "config": {"kernel_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "filters": 64, "strides": [1, 1], "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_6", "bias_constraint": null, "padding": "same"}, "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_6", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_3", "config": {"strides": [2, 2], "data_format": "channels_first", "name": "max_pooling2d_3", "pool_size": [2, 2], "trainable": true, "padding": "valid"}, "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_7", "config": {"kernel_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "filters": 128, "strides": [1, 1], "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_7", "bias_constraint": null, "padding": "same"}, "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_7", "config": {"name": "activation_7", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_8", "config": {"kernel_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "filters": 128, "strides": [1, 1], "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_8", "bias_constraint": null, "padding": "same"}, "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_8", "config": {"name": "activation_8", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_4", "config": {"strides": [2, 2], "data_format": "channels_first", "name": "max_pooling2d_4", "pool_size": [2, 2], "trainable": true, "padding": "valid"}, "inbound_nodes": [[["activation_8", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_9", "config": {"kernel_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "filters": 256, "strides": [1, 1], "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_9", "bias_constraint": null, "padding": "same"}, "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_9", "config": {"name": "activation_9", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_10", "config": {"kernel_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "filters": 256, "strides": [1, 1], "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_10", "bias_constraint": null, "padding": "same"}, "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_10", "config": {"name": "activation_10", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "name": "up_sampling2d_1", "config": {"name": "up_sampling2d_1", "data_format": "channels_first", "trainable": true, "size": [2, 2]}, "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_1", "config": {"name": "concatenate_1", "axis": 1, "trainable": true}, "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}], ["activation_8", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_11", "config": {"kernel_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "filters": 128, "strides": [1, 1], "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_11", "bias_constraint": null, "padding": "same"}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_11", "config": {"name": "activation_11", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_12", "config": {"kernel_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "filters": 128, "strides": [1, 1], "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_12", "bias_constraint": null, "padding": "same"}, "inbound_nodes": [[["activation_11", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_12", "config": {"name": "activation_12", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "name": "up_sampling2d_2", "config": {"name": "up_sampling2d_2", "data_format": "channels_first", "trainable": true, "size": [2, 2]}, "inbound_nodes": [[["activation_12", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_2", "config": {"name": "concatenate_2", "axis": 1, "trainable": true}, "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}], ["activation_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_13", "config": {"kernel_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "filters": 64, "strides": [1, 1], "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_13", "bias_constraint": null, "padding": "same"}, "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_13", "config": {"name": "activation_13", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_14", "config": {"kernel_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "filters": 64, "strides": [1, 1], "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_14", "bias_constraint": null, "padding": "same"}, "inbound_nodes": [[["activation_13", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_14", "config": {"name": "activation_14", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "name": "up_sampling2d_3", "config": {"name": "up_sampling2d_3", "data_format": "channels_first", "trainable": true, "size": [2, 2]}, "inbound_nodes": [[["activation_14", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_3", "config": {"name": "concatenate_3", "axis": 1, "trainable": true}, "inbound_nodes": [[["up_sampling2d_3", 0, 0, {}], ["activation_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_15", "config": {"kernel_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "filters": 32, "strides": [1, 1], "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_15", "bias_constraint": null, "padding": "same"}, "inbound_nodes": [[["concatenate_3", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_15", "config": {"name": "activation_15", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_16", "config": {"kernel_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "filters": 32, "strides": [1, 1], "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_16", "bias_constraint": null, "padding": "same"}, "inbound_nodes": [[["activation_15", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_16", "config": {"name": "activation_16", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "name": "up_sampling2d_4", "config": {"name": "up_sampling2d_4", "data_format": "channels_first", "trainable": true, "size": [2, 2]}, "inbound_nodes": [[["activation_16", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_4", "config": {"name": "concatenate_4", "axis": 1, "trainable": true}, "inbound_nodes": [[["up_sampling2d_4", 0, 0, {}], ["activation_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_17", "config": {"kernel_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "filters": 16, "strides": [1, 1], "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_17", "bias_constraint": null, "padding": "same"}, "inbound_nodes": [[["concatenate_4", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_17", "config": {"name": "activation_17", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_18", "config": {"kernel_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "filters": 16, "strides": [1, 1], "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_18", "bias_constraint": null, "padding": "same"}, "inbound_nodes": [[["activation_17", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_18", "config": {"name": "activation_18", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv2d_18", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_19", "config": {"kernel_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "filters": 2, "strides": [1, 1], "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_19", "bias_constraint": null, "padding": "valid"}, "inbound_nodes": [[["activation_18", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_19", "config": {"name": "activation_19", "trainable": true, "activation": "sigmoid"}, "inbound_nodes": [[["conv2d_19", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]]}}